/* automatically generated by rust-bindgen 0.57.0 */

pub type wchar_t = ::std::os::raw::c_ushort;
pub type int64 = ::std::os::raw::c_longlong;
pub type uint64 = ::std::os::raw::c_ulonglong;
pub type int32 = ::std::os::raw::c_int;
pub type uint32 = ::std::os::raw::c_uint;
pub type char16 = wchar_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_wide_t {
    pub str_: *mut wchar_t,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut wchar_t)>,
}
#[test]
fn bindgen_test_layout__cef_string_wide_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_string_wide_t>(),
        12usize,
        concat!("Size of: ", stringify!(_cef_string_wide_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_string_wide_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_string_wide_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_wide_t>())).str_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_wide_t),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_wide_t>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_wide_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_wide_t>())).dtor as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_wide_t),
            "::",
            stringify!(dtor)
        )
    );
}
pub type cef_string_wide_t = _cef_string_wide_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf8_t {
    pub str_: *mut ::std::os::raw::c_char,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut ::std::os::raw::c_char)>,
}
#[test]
fn bindgen_test_layout__cef_string_utf8_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_string_utf8_t>(),
        12usize,
        concat!("Size of: ", stringify!(_cef_string_utf8_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_string_utf8_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_string_utf8_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_utf8_t>())).str_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf8_t),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_utf8_t>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf8_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_utf8_t>())).dtor as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf8_t),
            "::",
            stringify!(dtor)
        )
    );
}
pub type cef_string_utf8_t = _cef_string_utf8_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf16_t {
    pub str_: *mut char16,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut char16)>,
}
#[test]
fn bindgen_test_layout__cef_string_utf16_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_string_utf16_t>(),
        12usize,
        concat!("Size of: ", stringify!(_cef_string_utf16_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_string_utf16_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_string_utf16_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_utf16_t>())).str_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf16_t),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_utf16_t>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf16_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_utf16_t>())).dtor as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf16_t),
            "::",
            stringify!(dtor)
        )
    );
}
pub type cef_string_utf16_t = _cef_string_utf16_t;
extern "C" {
    #[doc = ""]
    pub fn cef_string_wide_set(
        src: *const wchar_t, src_len: usize, output: *mut cef_string_wide_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_set(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_utf8_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_set(
        src: *const char16, src_len: usize, output: *mut cef_string_utf16_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_wide_clear(str_: *mut cef_string_wide_t);
}
extern "C" {
    pub fn cef_string_utf8_clear(str_: *mut cef_string_utf8_t);
}
extern "C" {
    pub fn cef_string_utf16_clear(str_: *mut cef_string_utf16_t);
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_wide_cmp(
        str1: *const cef_string_wide_t, str2: *const cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_cmp(
        str1: *const cef_string_utf8_t, str2: *const cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_cmp(
        str1: *const cef_string_utf16_t, str2: *const cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_wide_to_utf8(
        src: *const wchar_t, src_len: usize, output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_to_wide(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_wide_to_utf16(
        src: *const wchar_t, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_to_wide(
        src: *const char16, src_len: usize, output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_to_utf16(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_to_utf8(
        src: *const char16, src_len: usize, output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_ascii_to_wide(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_ascii_to_utf16(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
#[doc = ""]
pub type cef_string_userfree_wide_t = *mut cef_string_wide_t;
pub type cef_string_userfree_utf8_t = *mut cef_string_utf8_t;
pub type cef_string_userfree_utf16_t = *mut cef_string_utf16_t;
extern "C" {
    #[doc = ""]
    pub fn cef_string_userfree_wide_alloc() -> cef_string_userfree_wide_t;
}
extern "C" {
    pub fn cef_string_userfree_utf8_alloc() -> cef_string_userfree_utf8_t;
}
extern "C" {
    pub fn cef_string_userfree_utf16_alloc() -> cef_string_userfree_utf16_t;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_userfree_wide_free(str_: cef_string_userfree_wide_t);
}
extern "C" {
    pub fn cef_string_userfree_utf8_free(str_: cef_string_userfree_utf8_t);
}
extern "C" {
    pub fn cef_string_userfree_utf16_free(str_: cef_string_userfree_utf16_t);
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_utf16_to_lower(
        src: *const char16, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_to_upper(
        src: *const char16, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
pub type cef_char_t = char16;
pub type cef_string_userfree_t = cef_string_userfree_utf16_t;
pub type cef_string_t = cef_string_utf16_t;
#[doc = ""]
pub type cef_string_list_t = *mut ::std::os::raw::c_void;
extern "C" {
    #[doc = ""]
    pub fn cef_string_list_alloc() -> cef_string_list_t;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_list_size(list: cef_string_list_t) -> usize;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_list_value(
        list: cef_string_list_t, index: usize, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_list_append(list: cef_string_list_t, value: *const cef_string_t);
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_list_clear(list: cef_string_list_t);
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_list_free(list: cef_string_list_t);
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_list_copy(list: cef_string_list_t) -> cef_string_list_t;
}
#[doc = ""]
pub type cef_string_map_t = *mut ::std::os::raw::c_void;
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_alloc() -> cef_string_map_t;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_size(map: cef_string_map_t) -> usize;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_find(
        map: cef_string_map_t, key: *const cef_string_t, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_key(
        map: cef_string_map_t, index: usize, key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_value(
        map: cef_string_map_t, index: usize, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_append(
        map: cef_string_map_t, key: *const cef_string_t, value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_clear(map: cef_string_map_t);
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_map_free(map: cef_string_map_t);
}
#[doc = ""]
pub type cef_string_multimap_t = *mut ::std::os::raw::c_void;
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_alloc() -> cef_string_multimap_t;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_size(map: cef_string_multimap_t) -> usize;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_find_count(
        map: cef_string_multimap_t, key: *const cef_string_t,
    ) -> usize;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_enumerate(
        map: cef_string_multimap_t, key: *const cef_string_t, value_index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_key(
        map: cef_string_multimap_t, index: usize, key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_value(
        map: cef_string_multimap_t, index: usize, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_append(
        map: cef_string_multimap_t, key: *const cef_string_t, value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_clear(map: cef_string_multimap_t);
}
extern "C" {
    #[doc = ""]
    pub fn cef_string_multimap_free(map: cef_string_multimap_t);
}
pub type __time64_t = ::std::os::raw::c_longlong;
pub type time_t = __time64_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_time_t {
    pub year: ::std::os::raw::c_int,
    pub month: ::std::os::raw::c_int,
    pub day_of_week: ::std::os::raw::c_int,
    pub day_of_month: ::std::os::raw::c_int,
    pub hour: ::std::os::raw::c_int,
    pub minute: ::std::os::raw::c_int,
    pub second: ::std::os::raw::c_int,
    pub millisecond: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_time_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_time_t>(),
        32usize,
        concat!("Size of: ", stringify!(_cef_time_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_time_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_time_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).year as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).month as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).day_of_week as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(day_of_week)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).day_of_month as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(day_of_month)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).hour as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).minute as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(minute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).second as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(second)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_time_t>())).millisecond as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(millisecond)
        )
    );
}
#[doc = ""]
pub type cef_time_t = _cef_time_t;
extern "C" {
    #[doc = ""]
    pub fn cef_time_to_timet(
        cef_time: *const cef_time_t, time: *mut time_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_time_from_timet(time: time_t, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_time_to_doublet(
        cef_time: *const cef_time_t, time: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_time_from_doublet(time: f64, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_time_now(cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = ""]
    pub fn cef_time_delta(
        cef_time1: *const cef_time_t, cef_time2: *const cef_time_t,
        delta: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_int;
}
pub type DWORD = ::std::os::raw::c_ulong;
pub type UINT = ::std::os::raw::c_uint;
pub type UINT_PTR = ::std::os::raw::c_uint;
pub type LONG_PTR = ::std::os::raw::c_long;
pub type LONG = ::std::os::raw::c_long;
pub type WPARAM = UINT_PTR;
pub type LPARAM = LONG_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HINSTANCE__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HINSTANCE__() {
    assert_eq!(
        ::std::mem::size_of::<HINSTANCE__>(),
        4usize,
        concat!("Size of: ", stringify!(HINSTANCE__))
    );
    assert_eq!(
        ::std::mem::align_of::<HINSTANCE__>(),
        4usize,
        concat!("Alignment of ", stringify!(HINSTANCE__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HINSTANCE__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HINSTANCE__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HINSTANCE = *mut HINSTANCE__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HWND__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HWND__() {
    assert_eq!(
        ::std::mem::size_of::<HWND__>(),
        4usize,
        concat!("Size of: ", stringify!(HWND__))
    );
    assert_eq!(
        ::std::mem::align_of::<HWND__>(),
        4usize,
        concat!("Alignment of ", stringify!(HWND__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HWND__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HWND__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HWND = *mut HWND__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HICON__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HICON__() {
    assert_eq!(
        ::std::mem::size_of::<HICON__>(),
        4usize,
        concat!("Size of: ", stringify!(HICON__))
    );
    assert_eq!(
        ::std::mem::align_of::<HICON__>(),
        4usize,
        concat!("Alignment of ", stringify!(HICON__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HICON__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HICON__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HICON = *mut HICON__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HMENU__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HMENU__() {
    assert_eq!(
        ::std::mem::size_of::<HMENU__>(),
        4usize,
        concat!("Size of: ", stringify!(HMENU__))
    );
    assert_eq!(
        ::std::mem::align_of::<HMENU__>(),
        4usize,
        concat!("Alignment of ", stringify!(HMENU__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HMENU__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HMENU__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HMENU = *mut HMENU__;
pub type HCURSOR = HICON;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagPOINT {
    pub x: LONG,
    pub y: LONG,
}
#[test]
fn bindgen_test_layout_tagPOINT() {
    assert_eq!(
        ::std::mem::size_of::<tagPOINT>(),
        8usize,
        concat!("Size of: ", stringify!(tagPOINT))
    );
    assert_eq!(
        ::std::mem::align_of::<tagPOINT>(),
        4usize,
        concat!("Alignment of ", stringify!(tagPOINT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagPOINT>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagPOINT),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagPOINT>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagPOINT),
            "::",
            stringify!(y)
        )
    );
}
pub type POINT = tagPOINT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagMSG {
    pub hwnd: HWND,
    pub message: UINT,
    pub wParam: WPARAM,
    pub lParam: LPARAM,
    pub time: DWORD,
    pub pt: POINT,
}
#[test]
fn bindgen_test_layout_tagMSG() {
    assert_eq!(
        ::std::mem::size_of::<tagMSG>(),
        28usize,
        concat!("Size of: ", stringify!(tagMSG))
    );
    assert_eq!(
        ::std::mem::align_of::<tagMSG>(),
        4usize,
        concat!("Alignment of ", stringify!(tagMSG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagMSG>())).hwnd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagMSG),
            "::",
            stringify!(hwnd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagMSG>())).message as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagMSG),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagMSG>())).wParam as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagMSG),
            "::",
            stringify!(wParam)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagMSG>())).lParam as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tagMSG),
            "::",
            stringify!(lParam)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagMSG>())).time as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagMSG),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagMSG>())).pt as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tagMSG),
            "::",
            stringify!(pt)
        )
    );
}
pub type MSG = tagMSG;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_main_args_t {
    pub instance: HINSTANCE,
}
#[test]
fn bindgen_test_layout__cef_main_args_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_main_args_t>(),
        4usize,
        concat!("Size of: ", stringify!(_cef_main_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_main_args_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_main_args_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_main_args_t>())).instance as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_main_args_t),
            "::",
            stringify!(instance)
        )
    );
}
#[doc = ""]
pub type cef_main_args_t = _cef_main_args_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_window_info_t {
    pub ex_style: DWORD,
    pub window_name: cef_string_t,
    pub style: DWORD,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub parent_window: HWND,
    pub menu: HMENU,
    #[doc = ""]
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    #[doc = ""]
    pub shared_texture_enabled: ::std::os::raw::c_int,
    #[doc = ""]
    pub external_begin_frame_enabled: ::std::os::raw::c_int,
    #[doc = ""]
    pub window: HWND,
}
#[test]
fn bindgen_test_layout__cef_window_info_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_window_info_t>(),
        60usize,
        concat!("Size of: ", stringify!(_cef_window_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_window_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_window_info_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).ex_style as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(ex_style)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).window_name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(window_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).style as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).x as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).y as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).width as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).height as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_window_info_t>())).parent_window as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(parent_window)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).menu as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(menu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_window_info_t>())).windowless_rendering_enabled as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(windowless_rendering_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_window_info_t>())).shared_texture_enabled as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(shared_texture_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_window_info_t>())).external_begin_frame_enabled as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(external_begin_frame_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_window_info_t>())).window as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(window)
        )
    );
}
#[doc = ""]
pub type cef_window_info_t = _cef_window_info_t;
pub type cef_color_t = uint32;
pub mod cef_log_severity_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const LOGSEVERITY_DEFAULT: Type = 0;
    #[doc = ""]
    pub const LOGSEVERITY_VERBOSE: Type = 1;
    #[doc = ""]
    pub const LOGSEVERITY_DEBUG: Type = 1;
    #[doc = ""]
    pub const LOGSEVERITY_INFO: Type = 2;
    #[doc = ""]
    pub const LOGSEVERITY_WARNING: Type = 3;
    #[doc = ""]
    pub const LOGSEVERITY_ERROR: Type = 4;
    #[doc = ""]
    pub const LOGSEVERITY_FATAL: Type = 5;
    #[doc = ""]
    pub const LOGSEVERITY_DISABLE: Type = 99;
}
pub mod cef_state_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const STATE_DEFAULT: Type = 0;
    #[doc = ""]
    pub const STATE_ENABLED: Type = 1;
    #[doc = ""]
    pub const STATE_DISABLED: Type = 2;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_settings_t {
    #[doc = ""]
    pub size: usize,
    #[doc = ""]
    pub no_sandbox: ::std::os::raw::c_int,
    #[doc = ""]
    pub browser_subprocess_path: cef_string_t,
    #[doc = ""]
    pub framework_dir_path: cef_string_t,
    #[doc = ""]
    pub main_bundle_path: cef_string_t,
    #[doc = ""]
    pub chrome_runtime: ::std::os::raw::c_int,
    #[doc = ""]
    pub multi_threaded_message_loop: ::std::os::raw::c_int,
    #[doc = ""]
    pub external_message_pump: ::std::os::raw::c_int,
    #[doc = ""]
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    #[doc = ""]
    pub command_line_args_disabled: ::std::os::raw::c_int,
    #[doc = ""]
    pub cache_path: cef_string_t,
    #[doc = ""]
    pub root_cache_path: cef_string_t,
    #[doc = ""]
    pub user_data_path: cef_string_t,
    #[doc = ""]
    pub persist_session_cookies: ::std::os::raw::c_int,
    #[doc = ""]
    pub persist_user_preferences: ::std::os::raw::c_int,
    #[doc = ""]
    pub user_agent: cef_string_t,
    #[doc = ""]
    pub product_version: cef_string_t,
    #[doc = ""]
    pub locale: cef_string_t,
    #[doc = ""]
    pub log_file: cef_string_t,
    #[doc = ""]
    pub log_severity: cef_log_severity_t::Type,
    #[doc = ""]
    pub javascript_flags: cef_string_t,
    #[doc = ""]
    pub resources_dir_path: cef_string_t,
    #[doc = ""]
    pub locales_dir_path: cef_string_t,
    #[doc = ""]
    pub pack_loading_disabled: ::std::os::raw::c_int,
    #[doc = ""]
    pub remote_debugging_port: ::std::os::raw::c_int,
    #[doc = ""]
    pub uncaught_exception_stack_size: ::std::os::raw::c_int,
    #[doc = ""]
    pub ignore_certificate_errors: ::std::os::raw::c_int,
    #[doc = ""]
    pub background_color: cef_color_t,
    #[doc = ""]
    pub accept_language_list: cef_string_t,
    #[doc = ""]
    pub application_client_id_for_file_scanning: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_settings_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_settings_t>(),
        240usize,
        concat!("Size of: ", stringify!(_cef_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_settings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_settings_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).no_sandbox as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(no_sandbox)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).browser_subprocess_path as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(browser_subprocess_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).framework_dir_path as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(framework_dir_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).main_bundle_path as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(main_bundle_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).chrome_runtime as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(chrome_runtime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).multi_threaded_message_loop as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(multi_threaded_message_loop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).external_message_pump as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(external_message_pump)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).windowless_rendering_enabled as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(windowless_rendering_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).command_line_args_disabled as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(command_line_args_disabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).cache_path as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(cache_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).root_cache_path as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(root_cache_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).user_data_path as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(user_data_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).persist_session_cookies as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(persist_session_cookies)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).persist_user_preferences as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(persist_user_preferences)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).user_agent as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(user_agent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).product_version as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(product_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).locale as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(locale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).log_file as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(log_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_settings_t>())).log_severity as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(log_severity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).javascript_flags as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(javascript_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).resources_dir_path as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(resources_dir_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).locales_dir_path as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(locales_dir_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).pack_loading_disabled as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(pack_loading_disabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).remote_debugging_port as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(remote_debugging_port)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).uncaught_exception_stack_size as *const _
                as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(uncaught_exception_stack_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).ignore_certificate_errors as *const _
                as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(ignore_certificate_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).background_color as *const _ as usize
        },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).accept_language_list as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(accept_language_list)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_settings_t>())).application_client_id_for_file_scanning
                as *const _ as usize
        },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(application_client_id_for_file_scanning)
        )
    );
}
#[doc = ""]
pub type cef_settings_t = _cef_settings_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_request_context_settings_t {
    #[doc = ""]
    pub size: usize,
    #[doc = ""]
    pub cache_path: cef_string_t,
    #[doc = ""]
    pub persist_session_cookies: ::std::os::raw::c_int,
    #[doc = ""]
    pub persist_user_preferences: ::std::os::raw::c_int,
    #[doc = ""]
    pub ignore_certificate_errors: ::std::os::raw::c_int,
    #[doc = ""]
    pub accept_language_list: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_request_context_settings_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_request_context_settings_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_request_context_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_request_context_settings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_request_context_settings_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_context_settings_t>())).size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_context_settings_t>())).cache_path as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(cache_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_context_settings_t>())).persist_session_cookies
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(persist_session_cookies)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_context_settings_t>())).persist_user_preferences
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(persist_user_preferences)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_context_settings_t>())).ignore_certificate_errors
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(ignore_certificate_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_context_settings_t>())).accept_language_list
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(accept_language_list)
        )
    );
}
#[doc = ""]
pub type cef_request_context_settings_t = _cef_request_context_settings_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_browser_settings_t {
    #[doc = ""]
    pub size: usize,
    #[doc = ""]
    pub windowless_frame_rate: ::std::os::raw::c_int,
    #[doc = ""]
    pub standard_font_family: cef_string_t,
    pub fixed_font_family: cef_string_t,
    pub serif_font_family: cef_string_t,
    pub sans_serif_font_family: cef_string_t,
    pub cursive_font_family: cef_string_t,
    pub fantasy_font_family: cef_string_t,
    pub default_font_size: ::std::os::raw::c_int,
    pub default_fixed_font_size: ::std::os::raw::c_int,
    pub minimum_font_size: ::std::os::raw::c_int,
    pub minimum_logical_font_size: ::std::os::raw::c_int,
    #[doc = ""]
    pub default_encoding: cef_string_t,
    #[doc = ""]
    pub remote_fonts: cef_state_t::Type,
    #[doc = ""]
    pub javascript: cef_state_t::Type,
    #[doc = ""]
    pub javascript_close_windows: cef_state_t::Type,
    #[doc = ""]
    pub javascript_access_clipboard: cef_state_t::Type,
    #[doc = ""]
    pub javascript_dom_paste: cef_state_t::Type,
    #[doc = ""]
    pub plugins: cef_state_t::Type,
    #[doc = ""]
    pub universal_access_from_file_urls: cef_state_t::Type,
    #[doc = ""]
    pub file_access_from_file_urls: cef_state_t::Type,
    #[doc = ""]
    pub web_security: cef_state_t::Type,
    #[doc = ""]
    pub image_loading: cef_state_t::Type,
    #[doc = ""]
    pub image_shrink_standalone_to_fit: cef_state_t::Type,
    #[doc = ""]
    pub text_area_resize: cef_state_t::Type,
    #[doc = ""]
    pub tab_to_links: cef_state_t::Type,
    #[doc = ""]
    pub local_storage: cef_state_t::Type,
    #[doc = ""]
    pub databases: cef_state_t::Type,
    #[doc = ""]
    pub application_cache: cef_state_t::Type,
    #[doc = ""]
    pub webgl: cef_state_t::Type,
    #[doc = ""]
    pub background_color: cef_color_t,
    #[doc = ""]
    pub accept_language_list: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_browser_settings_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_browser_settings_t>(),
        192usize,
        concat!("Size of: ", stringify!(_cef_browser_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_browser_settings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_browser_settings_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_browser_settings_t>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).windowless_frame_rate as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(windowless_frame_rate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).standard_font_family as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(standard_font_family)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).fixed_font_family as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(fixed_font_family)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).serif_font_family as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(serif_font_family)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).sans_serif_font_family as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(sans_serif_font_family)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).cursive_font_family as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(cursive_font_family)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).fantasy_font_family as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(fantasy_font_family)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).default_font_size as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(default_font_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).default_fixed_font_size as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(default_fixed_font_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).minimum_font_size as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(minimum_font_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).minimum_logical_font_size
                as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(minimum_logical_font_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).default_encoding as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(default_encoding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).remote_fonts as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(remote_fonts)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).javascript as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).javascript_close_windows as *const _
                as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript_close_windows)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).javascript_access_clipboard
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript_access_clipboard)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).javascript_dom_paste as *const _
                as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript_dom_paste)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_browser_settings_t>())).plugins as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(plugins)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).universal_access_from_file_urls
                as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(universal_access_from_file_urls)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).file_access_from_file_urls
                as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(file_access_from_file_urls)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).web_security as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(web_security)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).image_loading as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(image_loading)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).image_shrink_standalone_to_fit
                as *const _ as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(image_shrink_standalone_to_fit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).text_area_resize as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(text_area_resize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).tab_to_links as *const _ as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(tab_to_links)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).local_storage as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(local_storage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).databases as *const _ as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(databases)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).application_cache as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(application_cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_browser_settings_t>())).webgl as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(webgl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).background_color as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_browser_settings_t>())).accept_language_list as *const _
                as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(accept_language_list)
        )
    );
}
#[doc = ""]
pub type cef_browser_settings_t = _cef_browser_settings_t;
pub mod cef_return_value_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const RV_CANCEL: Type = 0;
    #[doc = ""]
    pub const RV_CONTINUE: Type = 1;
    #[doc = ""]
    pub const RV_CONTINUE_ASYNC: Type = 2;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlparts_t {
    #[doc = ""]
    pub spec: cef_string_t,
    #[doc = ""]
    pub scheme: cef_string_t,
    #[doc = ""]
    pub username: cef_string_t,
    #[doc = ""]
    pub password: cef_string_t,
    #[doc = ""]
    pub host: cef_string_t,
    #[doc = ""]
    pub port: cef_string_t,
    #[doc = ""]
    pub origin: cef_string_t,
    #[doc = ""]
    pub path: cef_string_t,
    #[doc = ""]
    pub query: cef_string_t,
    #[doc = ""]
    pub fragment: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_urlparts_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_urlparts_t>(),
        120usize,
        concat!("Size of: ", stringify!(_cef_urlparts_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_urlparts_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_urlparts_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).spec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(spec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).scheme as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(scheme)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).username as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(username)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).password as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).host as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).port as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).origin as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(origin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).path as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).query as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(query)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_urlparts_t>())).fragment as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(fragment)
        )
    );
}
#[doc = ""]
pub type cef_urlparts_t = _cef_urlparts_t;
pub mod cef_cookie_priority_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_COOKIE_PRIORITY_LOW: Type = -1;
    pub const CEF_COOKIE_PRIORITY_MEDIUM: Type = 0;
    pub const CEF_COOKIE_PRIORITY_HIGH: Type = 1;
}
pub mod cef_cookie_same_site_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_COOKIE_SAME_SITE_UNSPECIFIED: Type = 0;
    pub const CEF_COOKIE_SAME_SITE_NO_RESTRICTION: Type = 1;
    pub const CEF_COOKIE_SAME_SITE_LAX_MODE: Type = 2;
    pub const CEF_COOKIE_SAME_SITE_STRICT_MODE: Type = 3;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cookie_t {
    #[doc = ""]
    pub name: cef_string_t,
    #[doc = ""]
    pub value: cef_string_t,
    #[doc = ""]
    pub domain: cef_string_t,
    #[doc = ""]
    pub path: cef_string_t,
    #[doc = ""]
    pub secure: ::std::os::raw::c_int,
    #[doc = ""]
    pub httponly: ::std::os::raw::c_int,
    #[doc = ""]
    pub creation: cef_time_t,
    #[doc = ""]
    pub last_access: cef_time_t,
    #[doc = ""]
    pub has_expires: ::std::os::raw::c_int,
    pub expires: cef_time_t,
    #[doc = ""]
    pub same_site: cef_cookie_same_site_t::Type,
    #[doc = ""]
    pub priority: cef_cookie_priority_t::Type,
}
#[test]
fn bindgen_test_layout__cef_cookie_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_cookie_t>(),
        164usize,
        concat!("Size of: ", stringify!(_cef_cookie_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_cookie_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_cookie_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).value as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).domain as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).path as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).secure as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(secure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).httponly as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(httponly)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).creation as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(creation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).last_access as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(last_access)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).has_expires as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(has_expires)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).expires as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(expires)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).same_site as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(same_site)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cookie_t>())).priority as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(priority)
        )
    );
}
#[doc = ""]
pub type cef_cookie_t = _cef_cookie_t;
pub mod cef_termination_status_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const TS_ABNORMAL_TERMINATION: Type = 0;
    #[doc = ""]
    pub const TS_PROCESS_WAS_KILLED: Type = 1;
    #[doc = ""]
    pub const TS_PROCESS_CRASHED: Type = 2;
    #[doc = ""]
    pub const TS_PROCESS_OOM: Type = 3;
}
pub mod cef_path_key_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const PK_DIR_CURRENT: Type = 0;
    #[doc = ""]
    pub const PK_DIR_EXE: Type = 1;
    #[doc = ""]
    pub const PK_DIR_MODULE: Type = 2;
    #[doc = ""]
    pub const PK_DIR_TEMP: Type = 3;
    #[doc = ""]
    pub const PK_FILE_EXE: Type = 4;
    #[doc = ""]
    pub const PK_FILE_MODULE: Type = 5;
    #[doc = ""]
    pub const PK_LOCAL_APP_DATA: Type = 6;
    #[doc = ""]
    pub const PK_USER_DATA: Type = 7;
    #[doc = ""]
    pub const PK_DIR_RESOURCES: Type = 8;
}
pub mod cef_storage_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const ST_LOCALSTORAGE: Type = 0;
    pub const ST_SESSIONSTORAGE: Type = 1;
}
pub mod cef_errorcode_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const ERR_NONE: Type = 0;
    pub const ERR_IO_PENDING: Type = -1;
    pub const ERR_FAILED: Type = -2;
    pub const ERR_ABORTED: Type = -3;
    pub const ERR_INVALID_ARGUMENT: Type = -4;
    pub const ERR_INVALID_HANDLE: Type = -5;
    pub const ERR_FILE_NOT_FOUND: Type = -6;
    pub const ERR_TIMED_OUT: Type = -7;
    pub const ERR_FILE_TOO_BIG: Type = -8;
    pub const ERR_UNEXPECTED: Type = -9;
    pub const ERR_ACCESS_DENIED: Type = -10;
    pub const ERR_NOT_IMPLEMENTED: Type = -11;
    pub const ERR_INSUFFICIENT_RESOURCES: Type = -12;
    pub const ERR_OUT_OF_MEMORY: Type = -13;
    pub const ERR_UPLOAD_FILE_CHANGED: Type = -14;
    pub const ERR_SOCKET_NOT_CONNECTED: Type = -15;
    pub const ERR_FILE_EXISTS: Type = -16;
    pub const ERR_FILE_PATH_TOO_LONG: Type = -17;
    pub const ERR_FILE_NO_SPACE: Type = -18;
    pub const ERR_FILE_VIRUS_INFECTED: Type = -19;
    pub const ERR_BLOCKED_BY_CLIENT: Type = -20;
    pub const ERR_NETWORK_CHANGED: Type = -21;
    pub const ERR_BLOCKED_BY_ADMINISTRATOR: Type = -22;
    pub const ERR_SOCKET_IS_CONNECTED: Type = -23;
    pub const ERR_BLOCKED_ENROLLMENT_CHECK_PENDING: Type = -24;
    pub const ERR_UPLOAD_STREAM_REWIND_NOT_SUPPORTED: Type = -25;
    pub const ERR_CONTEXT_SHUT_DOWN: Type = -26;
    pub const ERR_BLOCKED_BY_RESPONSE: Type = -27;
    pub const ERR_CLEARTEXT_NOT_PERMITTED: Type = -29;
    pub const ERR_BLOCKED_BY_CSP: Type = -30;
    pub const ERR_H2_OR_QUIC_REQUIRED: Type = -31;
    pub const ERR_CONNECTION_CLOSED: Type = -100;
    pub const ERR_CONNECTION_RESET: Type = -101;
    pub const ERR_CONNECTION_REFUSED: Type = -102;
    pub const ERR_CONNECTION_ABORTED: Type = -103;
    pub const ERR_CONNECTION_FAILED: Type = -104;
    pub const ERR_NAME_NOT_RESOLVED: Type = -105;
    pub const ERR_INTERNET_DISCONNECTED: Type = -106;
    pub const ERR_SSL_PROTOCOL_ERROR: Type = -107;
    pub const ERR_ADDRESS_INVALID: Type = -108;
    pub const ERR_ADDRESS_UNREACHABLE: Type = -109;
    pub const ERR_SSL_CLIENT_AUTH_CERT_NEEDED: Type = -110;
    pub const ERR_TUNNEL_CONNECTION_FAILED: Type = -111;
    pub const ERR_NO_SSL_VERSIONS_ENABLED: Type = -112;
    pub const ERR_SSL_VERSION_OR_CIPHER_MISMATCH: Type = -113;
    pub const ERR_SSL_RENEGOTIATION_REQUESTED: Type = -114;
    pub const ERR_PROXY_AUTH_UNSUPPORTED: Type = -115;
    pub const ERR_CERT_ERROR_IN_SSL_RENEGOTIATION: Type = -116;
    pub const ERR_BAD_SSL_CLIENT_AUTH_CERT: Type = -117;
    pub const ERR_CONNECTION_TIMED_OUT: Type = -118;
    pub const ERR_HOST_RESOLVER_QUEUE_TOO_LARGE: Type = -119;
    pub const ERR_SOCKS_CONNECTION_FAILED: Type = -120;
    pub const ERR_SOCKS_CONNECTION_HOST_UNREACHABLE: Type = -121;
    pub const ERR_ALPN_NEGOTIATION_FAILED: Type = -122;
    pub const ERR_SSL_NO_RENEGOTIATION: Type = -123;
    pub const ERR_WINSOCK_UNEXPECTED_WRITTEN_BYTES: Type = -124;
    pub const ERR_SSL_DECOMPRESSION_FAILURE_ALERT: Type = -125;
    pub const ERR_SSL_BAD_RECORD_MAC_ALERT: Type = -126;
    pub const ERR_PROXY_AUTH_REQUESTED: Type = -127;
    pub const ERR_PROXY_CONNECTION_FAILED: Type = -130;
    pub const ERR_MANDATORY_PROXY_CONFIGURATION_FAILED: Type = -131;
    pub const ERR_PRECONNECT_MAX_SOCKET_LIMIT: Type = -133;
    pub const ERR_SSL_CLIENT_AUTH_PRIVATE_KEY_ACCESS_DENIED: Type = -134;
    pub const ERR_SSL_CLIENT_AUTH_CERT_NO_PRIVATE_KEY: Type = -135;
    pub const ERR_PROXY_CERTIFICATE_INVALID: Type = -136;
    pub const ERR_NAME_RESOLUTION_FAILED: Type = -137;
    pub const ERR_NETWORK_ACCESS_DENIED: Type = -138;
    pub const ERR_TEMPORARILY_THROTTLED: Type = -139;
    pub const ERR_HTTPS_PROXY_TUNNEL_RESPONSE_REDIRECT: Type = -140;
    pub const ERR_SSL_CLIENT_AUTH_SIGNATURE_FAILED: Type = -141;
    pub const ERR_MSG_TOO_BIG: Type = -142;
    pub const ERR_WS_PROTOCOL_ERROR: Type = -145;
    pub const ERR_ADDRESS_IN_USE: Type = -147;
    pub const ERR_SSL_HANDSHAKE_NOT_COMPLETED: Type = -148;
    pub const ERR_SSL_BAD_PEER_PUBLIC_KEY: Type = -149;
    pub const ERR_SSL_PINNED_KEY_NOT_IN_CERT_CHAIN: Type = -150;
    pub const ERR_CLIENT_AUTH_CERT_TYPE_UNSUPPORTED: Type = -151;
    pub const ERR_SSL_DECRYPT_ERROR_ALERT: Type = -153;
    pub const ERR_WS_THROTTLE_QUEUE_TOO_LARGE: Type = -154;
    pub const ERR_SSL_SERVER_CERT_CHANGED: Type = -156;
    pub const ERR_SSL_UNRECOGNIZED_NAME_ALERT: Type = -159;
    pub const ERR_SOCKET_SET_RECEIVE_BUFFER_SIZE_ERROR: Type = -160;
    pub const ERR_SOCKET_SET_SEND_BUFFER_SIZE_ERROR: Type = -161;
    pub const ERR_SOCKET_RECEIVE_BUFFER_SIZE_UNCHANGEABLE: Type = -162;
    pub const ERR_SOCKET_SEND_BUFFER_SIZE_UNCHANGEABLE: Type = -163;
    pub const ERR_SSL_CLIENT_AUTH_CERT_BAD_FORMAT: Type = -164;
    pub const ERR_ICANN_NAME_COLLISION: Type = -166;
    pub const ERR_SSL_SERVER_CERT_BAD_FORMAT: Type = -167;
    pub const ERR_CT_STH_PARSING_FAILED: Type = -168;
    pub const ERR_CT_STH_INCOMPLETE: Type = -169;
    pub const ERR_UNABLE_TO_REUSE_CONNECTION_FOR_PROXY_AUTH: Type = -170;
    pub const ERR_CT_CONSISTENCY_PROOF_PARSING_FAILED: Type = -171;
    pub const ERR_SSL_OBSOLETE_CIPHER: Type = -172;
    pub const ERR_WS_UPGRADE: Type = -173;
    pub const ERR_READ_IF_READY_NOT_IMPLEMENTED: Type = -174;
    pub const ERR_NO_BUFFER_SPACE: Type = -176;
    pub const ERR_SSL_CLIENT_AUTH_NO_COMMON_ALGORITHMS: Type = -177;
    pub const ERR_EARLY_DATA_REJECTED: Type = -178;
    pub const ERR_WRONG_VERSION_ON_EARLY_DATA: Type = -179;
    pub const ERR_TLS13_DOWNGRADE_DETECTED: Type = -180;
    pub const ERR_SSL_KEY_USAGE_INCOMPATIBLE: Type = -181;
    pub const ERR_CERT_COMMON_NAME_INVALID: Type = -200;
    pub const ERR_CERT_DATE_INVALID: Type = -201;
    pub const ERR_CERT_AUTHORITY_INVALID: Type = -202;
    pub const ERR_CERT_CONTAINS_ERRORS: Type = -203;
    pub const ERR_CERT_NO_REVOCATION_MECHANISM: Type = -204;
    pub const ERR_CERT_UNABLE_TO_CHECK_REVOCATION: Type = -205;
    pub const ERR_CERT_REVOKED: Type = -206;
    pub const ERR_CERT_INVALID: Type = -207;
    pub const ERR_CERT_WEAK_SIGNATURE_ALGORITHM: Type = -208;
    pub const ERR_CERT_NON_UNIQUE_NAME: Type = -210;
    pub const ERR_CERT_WEAK_KEY: Type = -211;
    pub const ERR_CERT_NAME_CONSTRAINT_VIOLATION: Type = -212;
    pub const ERR_CERT_VALIDITY_TOO_LONG: Type = -213;
    pub const ERR_CERTIFICATE_TRANSPARENCY_REQUIRED: Type = -214;
    pub const ERR_CERT_SYMANTEC_LEGACY: Type = -215;
    pub const ERR_CERT_KNOWN_INTERCEPTION_BLOCKED: Type = -217;
    pub const ERR_SSL_OBSOLETE_VERSION: Type = -218;
    pub const ERR_CERT_END: Type = -219;
    pub const ERR_INVALID_URL: Type = -300;
    pub const ERR_DISALLOWED_URL_SCHEME: Type = -301;
    pub const ERR_UNKNOWN_URL_SCHEME: Type = -302;
    pub const ERR_INVALID_REDIRECT: Type = -303;
    pub const ERR_TOO_MANY_REDIRECTS: Type = -310;
    pub const ERR_UNSAFE_REDIRECT: Type = -311;
    pub const ERR_UNSAFE_PORT: Type = -312;
    pub const ERR_INVALID_RESPONSE: Type = -320;
    pub const ERR_INVALID_CHUNKED_ENCODING: Type = -321;
    pub const ERR_METHOD_NOT_SUPPORTED: Type = -322;
    pub const ERR_UNEXPECTED_PROXY_AUTH: Type = -323;
    pub const ERR_EMPTY_RESPONSE: Type = -324;
    pub const ERR_RESPONSE_HEADERS_TOO_BIG: Type = -325;
    pub const ERR_PAC_SCRIPT_FAILED: Type = -327;
    pub const ERR_REQUEST_RANGE_NOT_SATISFIABLE: Type = -328;
    pub const ERR_MALFORMED_IDENTITY: Type = -329;
    pub const ERR_CONTENT_DECODING_FAILED: Type = -330;
    pub const ERR_NETWORK_IO_SUSPENDED: Type = -331;
    pub const ERR_SYN_REPLY_NOT_RECEIVED: Type = -332;
    pub const ERR_ENCODING_CONVERSION_FAILED: Type = -333;
    pub const ERR_UNRECOGNIZED_FTP_DIRECTORY_LISTING_FORMAT: Type = -334;
    pub const ERR_NO_SUPPORTED_PROXIES: Type = -336;
    pub const ERR_HTTP2_PROTOCOL_ERROR: Type = -337;
    pub const ERR_INVALID_AUTH_CREDENTIALS: Type = -338;
    pub const ERR_UNSUPPORTED_AUTH_SCHEME: Type = -339;
    pub const ERR_ENCODING_DETECTION_FAILED: Type = -340;
    pub const ERR_MISSING_AUTH_CREDENTIALS: Type = -341;
    pub const ERR_UNEXPECTED_SECURITY_LIBRARY_STATUS: Type = -342;
    pub const ERR_MISCONFIGURED_AUTH_ENVIRONMENT: Type = -343;
    pub const ERR_UNDOCUMENTED_SECURITY_LIBRARY_STATUS: Type = -344;
    pub const ERR_RESPONSE_BODY_TOO_BIG_TO_DRAIN: Type = -345;
    pub const ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_LENGTH: Type = -346;
    pub const ERR_INCOMPLETE_HTTP2_HEADERS: Type = -347;
    pub const ERR_PAC_NOT_IN_DHCP: Type = -348;
    pub const ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_DISPOSITION: Type = -349;
    pub const ERR_RESPONSE_HEADERS_MULTIPLE_LOCATION: Type = -350;
    pub const ERR_HTTP2_SERVER_REFUSED_STREAM: Type = -351;
    pub const ERR_HTTP2_PING_FAILED: Type = -352;
    pub const ERR_CONTENT_LENGTH_MISMATCH: Type = -354;
    pub const ERR_INCOMPLETE_CHUNKED_ENCODING: Type = -355;
    pub const ERR_QUIC_PROTOCOL_ERROR: Type = -356;
    pub const ERR_RESPONSE_HEADERS_TRUNCATED: Type = -357;
    pub const ERR_QUIC_HANDSHAKE_FAILED: Type = -358;
    pub const ERR_HTTP2_INADEQUATE_TRANSPORT_SECURITY: Type = -360;
    pub const ERR_HTTP2_FLOW_CONTROL_ERROR: Type = -361;
    pub const ERR_HTTP2_FRAME_SIZE_ERROR: Type = -362;
    pub const ERR_HTTP2_COMPRESSION_ERROR: Type = -363;
    pub const ERR_PROXY_AUTH_REQUESTED_WITH_NO_CONNECTION: Type = -364;
    pub const ERR_HTTP_1_1_REQUIRED: Type = -365;
    pub const ERR_PROXY_HTTP_1_1_REQUIRED: Type = -366;
    pub const ERR_PAC_SCRIPT_TERMINATED: Type = -367;
    pub const ERR_INVALID_HTTP_RESPONSE: Type = -370;
    pub const ERR_CONTENT_DECODING_INIT_FAILED: Type = -371;
    pub const ERR_HTTP2_RST_STREAM_NO_ERROR_RECEIVED: Type = -372;
    pub const ERR_HTTP2_PUSHED_STREAM_NOT_AVAILABLE: Type = -373;
    pub const ERR_HTTP2_CLAIMED_PUSHED_STREAM_RESET_BY_SERVER: Type = -374;
    pub const ERR_TOO_MANY_RETRIES: Type = -375;
    pub const ERR_HTTP2_STREAM_CLOSED: Type = -376;
    pub const ERR_HTTP2_CLIENT_REFUSED_STREAM: Type = -377;
    pub const ERR_HTTP2_PUSHED_RESPONSE_DOES_NOT_MATCH: Type = -378;
    pub const ERR_HTTP_RESPONSE_CODE_FAILURE: Type = -379;
    pub const ERR_QUIC_CERT_ROOT_NOT_KNOWN: Type = -380;
    pub const ERR_QUIC_GOAWAY_REQUEST_CAN_BE_RETRIED: Type = -381;
    pub const ERR_CACHE_MISS: Type = -400;
    pub const ERR_CACHE_READ_FAILURE: Type = -401;
    pub const ERR_CACHE_WRITE_FAILURE: Type = -402;
    pub const ERR_CACHE_OPERATION_NOT_SUPPORTED: Type = -403;
    pub const ERR_CACHE_OPEN_FAILURE: Type = -404;
    pub const ERR_CACHE_CREATE_FAILURE: Type = -405;
    pub const ERR_CACHE_RACE: Type = -406;
    pub const ERR_CACHE_CHECKSUM_READ_FAILURE: Type = -407;
    pub const ERR_CACHE_CHECKSUM_MISMATCH: Type = -408;
    pub const ERR_CACHE_LOCK_TIMEOUT: Type = -409;
    pub const ERR_CACHE_AUTH_FAILURE_AFTER_READ: Type = -410;
    pub const ERR_CACHE_ENTRY_NOT_SUITABLE: Type = -411;
    pub const ERR_CACHE_DOOM_FAILURE: Type = -412;
    pub const ERR_CACHE_OPEN_OR_CREATE_FAILURE: Type = -413;
    pub const ERR_INSECURE_RESPONSE: Type = -501;
    pub const ERR_NO_PRIVATE_KEY_FOR_CERT: Type = -502;
    pub const ERR_ADD_USER_CERT_FAILED: Type = -503;
    pub const ERR_INVALID_SIGNED_EXCHANGE: Type = -504;
    pub const ERR_INVALID_WEB_BUNDLE: Type = -505;
    pub const ERR_TRUST_TOKEN_OPERATION_FAILED: Type = -506;
    pub const ERR_TRUST_TOKEN_OPERATION_SUCCESS_WITHOUT_SENDING_REQUEST: Type = -507;
    pub const ERR_FTP_FAILED: Type = -601;
    pub const ERR_FTP_SERVICE_UNAVAILABLE: Type = -602;
    pub const ERR_FTP_TRANSFER_ABORTED: Type = -603;
    pub const ERR_FTP_FILE_BUSY: Type = -604;
    pub const ERR_FTP_SYNTAX_ERROR: Type = -605;
    pub const ERR_FTP_COMMAND_NOT_SUPPORTED: Type = -606;
    pub const ERR_FTP_BAD_COMMAND_SEQUENCE: Type = -607;
    pub const ERR_PKCS12_IMPORT_BAD_PASSWORD: Type = -701;
    pub const ERR_PKCS12_IMPORT_FAILED: Type = -702;
    pub const ERR_IMPORT_CA_CERT_NOT_CA: Type = -703;
    pub const ERR_IMPORT_CERT_ALREADY_EXISTS: Type = -704;
    pub const ERR_IMPORT_CA_CERT_FAILED: Type = -705;
    pub const ERR_IMPORT_SERVER_CERT_FAILED: Type = -706;
    pub const ERR_PKCS12_IMPORT_INVALID_MAC: Type = -707;
    pub const ERR_PKCS12_IMPORT_INVALID_FILE: Type = -708;
    pub const ERR_PKCS12_IMPORT_UNSUPPORTED: Type = -709;
    pub const ERR_KEY_GENERATION_FAILED: Type = -710;
    pub const ERR_PRIVATE_KEY_EXPORT_FAILED: Type = -712;
    pub const ERR_SELF_SIGNED_CERT_GENERATION_FAILED: Type = -713;
    pub const ERR_CERT_DATABASE_CHANGED: Type = -714;
    pub const ERR_DNS_MALFORMED_RESPONSE: Type = -800;
    pub const ERR_DNS_SERVER_REQUIRES_TCP: Type = -801;
    pub const ERR_DNS_SERVER_FAILED: Type = -802;
    pub const ERR_DNS_TIMED_OUT: Type = -803;
    pub const ERR_DNS_CACHE_MISS: Type = -804;
    pub const ERR_DNS_SEARCH_EMPTY: Type = -805;
    pub const ERR_DNS_SORT_ERROR: Type = -806;
    pub const ERR_DNS_SECURE_RESOLVER_HOSTNAME_RESOLUTION_FAILED: Type = -808;
}
pub mod cef_cert_status_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CERT_STATUS_NONE: Type = 0;
    pub const CERT_STATUS_COMMON_NAME_INVALID: Type = 1;
    pub const CERT_STATUS_DATE_INVALID: Type = 2;
    pub const CERT_STATUS_AUTHORITY_INVALID: Type = 4;
    pub const CERT_STATUS_NO_REVOCATION_MECHANISM: Type = 16;
    pub const CERT_STATUS_UNABLE_TO_CHECK_REVOCATION: Type = 32;
    pub const CERT_STATUS_REVOKED: Type = 64;
    pub const CERT_STATUS_INVALID: Type = 128;
    pub const CERT_STATUS_WEAK_SIGNATURE_ALGORITHM: Type = 256;
    pub const CERT_STATUS_NON_UNIQUE_NAME: Type = 1024;
    pub const CERT_STATUS_WEAK_KEY: Type = 2048;
    pub const CERT_STATUS_PINNED_KEY_MISSING: Type = 8192;
    pub const CERT_STATUS_NAME_CONSTRAINT_VIOLATION: Type = 16384;
    pub const CERT_STATUS_VALIDITY_TOO_LONG: Type = 32768;
    pub const CERT_STATUS_IS_EV: Type = 65536;
    pub const CERT_STATUS_REV_CHECKING_ENABLED: Type = 131072;
    pub const CERT_STATUS_SHA1_SIGNATURE_PRESENT: Type = 524288;
    pub const CERT_STATUS_CT_COMPLIANCE_FAILED: Type = 1048576;
}
pub mod cef_window_open_disposition_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const WOD_UNKNOWN: Type = 0;
    pub const WOD_CURRENT_TAB: Type = 1;
    pub const WOD_SINGLETON_TAB: Type = 2;
    pub const WOD_NEW_FOREGROUND_TAB: Type = 3;
    pub const WOD_NEW_BACKGROUND_TAB: Type = 4;
    pub const WOD_NEW_POPUP: Type = 5;
    pub const WOD_NEW_WINDOW: Type = 6;
    pub const WOD_SAVE_TO_DISK: Type = 7;
    pub const WOD_OFF_THE_RECORD: Type = 8;
    pub const WOD_IGNORE_ACTION: Type = 9;
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_NONE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(0);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_COPY: cef_drag_operations_mask_t = cef_drag_operations_mask_t(1);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_LINK: cef_drag_operations_mask_t = cef_drag_operations_mask_t(2);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_GENERIC: cef_drag_operations_mask_t = cef_drag_operations_mask_t(4);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_PRIVATE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(8);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_MOVE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(16);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_DELETE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(32);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_EVERY: cef_drag_operations_mask_t = cef_drag_operations_mask_t(-1);
}
impl ::std::ops::BitOr<cef_drag_operations_mask_t> for cef_drag_operations_mask_t {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        cef_drag_operations_mask_t(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for cef_drag_operations_mask_t {
    #[inline]
    fn bitor_assign(&mut self, rhs: cef_drag_operations_mask_t) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<cef_drag_operations_mask_t> for cef_drag_operations_mask_t {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        cef_drag_operations_mask_t(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for cef_drag_operations_mask_t {
    #[inline]
    fn bitand_assign(&mut self, rhs: cef_drag_operations_mask_t) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = ""]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct cef_drag_operations_mask_t(pub ::std::os::raw::c_int);
pub mod cef_text_input_mode_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TEXT_INPUT_MODE_DEFAULT: Type = 0;
    pub const CEF_TEXT_INPUT_MODE_NONE: Type = 1;
    pub const CEF_TEXT_INPUT_MODE_TEXT: Type = 2;
    pub const CEF_TEXT_INPUT_MODE_TEL: Type = 3;
    pub const CEF_TEXT_INPUT_MODE_URL: Type = 4;
    pub const CEF_TEXT_INPUT_MODE_EMAIL: Type = 5;
    pub const CEF_TEXT_INPUT_MODE_NUMERIC: Type = 6;
    pub const CEF_TEXT_INPUT_MODE_DECIMAL: Type = 7;
    pub const CEF_TEXT_INPUT_MODE_SEARCH: Type = 8;
    pub const CEF_TEXT_INPUT_MODE_MAX: Type = 8;
}
pub mod cef_v8_accesscontrol_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const V8_ACCESS_CONTROL_DEFAULT: Type = 0;
    pub const V8_ACCESS_CONTROL_ALL_CAN_READ: Type = 1;
    pub const V8_ACCESS_CONTROL_ALL_CAN_WRITE: Type = 2;
    pub const V8_ACCESS_CONTROL_PROHIBITS_OVERWRITING: Type = 4;
}
pub mod cef_v8_propertyattribute_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const V8_PROPERTY_ATTRIBUTE_NONE: Type = 0;
    pub const V8_PROPERTY_ATTRIBUTE_READONLY: Type = 1;
    pub const V8_PROPERTY_ATTRIBUTE_DONTENUM: Type = 2;
    pub const V8_PROPERTY_ATTRIBUTE_DONTDELETE: Type = 4;
}
pub mod cef_postdataelement_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const PDE_TYPE_EMPTY: Type = 0;
    pub const PDE_TYPE_BYTES: Type = 1;
    pub const PDE_TYPE_FILE: Type = 2;
}
pub mod cef_resource_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const RT_MAIN_FRAME: Type = 0;
    #[doc = ""]
    pub const RT_SUB_FRAME: Type = 1;
    #[doc = ""]
    pub const RT_STYLESHEET: Type = 2;
    #[doc = ""]
    pub const RT_SCRIPT: Type = 3;
    #[doc = ""]
    pub const RT_IMAGE: Type = 4;
    #[doc = ""]
    pub const RT_FONT_RESOURCE: Type = 5;
    #[doc = ""]
    pub const RT_SUB_RESOURCE: Type = 6;
    #[doc = ""]
    pub const RT_OBJECT: Type = 7;
    #[doc = ""]
    pub const RT_MEDIA: Type = 8;
    #[doc = ""]
    pub const RT_WORKER: Type = 9;
    #[doc = ""]
    pub const RT_SHARED_WORKER: Type = 10;
    #[doc = ""]
    pub const RT_PREFETCH: Type = 11;
    #[doc = ""]
    pub const RT_FAVICON: Type = 12;
    #[doc = ""]
    pub const RT_XHR: Type = 13;
    #[doc = ""]
    pub const RT_PING: Type = 14;
    #[doc = ""]
    pub const RT_SERVICE_WORKER: Type = 15;
    #[doc = ""]
    pub const RT_CSP_REPORT: Type = 16;
    #[doc = ""]
    pub const RT_PLUGIN_RESOURCE: Type = 17;
}
pub mod cef_transition_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const TT_LINK: Type = 0;
    #[doc = ""]
    pub const TT_EXPLICIT: Type = 1;
    #[doc = ""]
    pub const TT_AUTO_SUBFRAME: Type = 3;
    #[doc = ""]
    pub const TT_MANUAL_SUBFRAME: Type = 4;
    #[doc = ""]
    pub const TT_FORM_SUBMIT: Type = 7;
    #[doc = ""]
    pub const TT_RELOAD: Type = 8;
    #[doc = ""]
    pub const TT_SOURCE_MASK: Type = 255;
    #[doc = ""]
    pub const TT_BLOCKED_FLAG: Type = 8388608;
    #[doc = ""]
    pub const TT_FORWARD_BACK_FLAG: Type = 16777216;
    #[doc = ""]
    pub const TT_DIRECT_LOAD_FLAG: Type = 33554432;
    #[doc = ""]
    pub const TT_CHAIN_START_FLAG: Type = 268435456;
    #[doc = ""]
    pub const TT_CHAIN_END_FLAG: Type = 536870912;
    #[doc = ""]
    pub const TT_CLIENT_REDIRECT_FLAG: Type = 1073741824;
    #[doc = ""]
    pub const TT_SERVER_REDIRECT_FLAG: Type = -2147483648;
    #[doc = ""]
    pub const TT_IS_REDIRECT_MASK: Type = -1073741824;
    #[doc = ""]
    pub const TT_QUALIFIER_MASK: Type = -256;
}
pub mod cef_urlrequest_flags_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const UR_FLAG_NONE: Type = 0;
    #[doc = ""]
    pub const UR_FLAG_SKIP_CACHE: Type = 1;
    #[doc = ""]
    pub const UR_FLAG_ONLY_FROM_CACHE: Type = 2;
    #[doc = ""]
    pub const UR_FLAG_DISABLE_CACHE: Type = 4;
    #[doc = ""]
    pub const UR_FLAG_ALLOW_STORED_CREDENTIALS: Type = 8;
    #[doc = ""]
    pub const UR_FLAG_REPORT_UPLOAD_PROGRESS: Type = 16;
    #[doc = ""]
    pub const UR_FLAG_NO_DOWNLOAD_DATA: Type = 32;
    #[doc = ""]
    pub const UR_FLAG_NO_RETRY_ON_5XX: Type = 64;
    #[doc = ""]
    pub const UR_FLAG_STOP_ON_REDIRECT: Type = 128;
}
pub mod cef_urlrequest_status_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const UR_UNKNOWN: Type = 0;
    #[doc = ""]
    pub const UR_SUCCESS: Type = 1;
    #[doc = ""]
    pub const UR_IO_PENDING: Type = 2;
    #[doc = ""]
    pub const UR_CANCELED: Type = 3;
    #[doc = ""]
    pub const UR_FAILED: Type = 4;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_point_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_point_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_point_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_point_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_point_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_point_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_point_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_point_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_point_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_point_t),
            "::",
            stringify!(y)
        )
    );
}
#[doc = ""]
pub type cef_point_t = _cef_point_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_rect_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_rect_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_rect_t>(),
        16usize,
        concat!("Size of: ", stringify!(_cef_rect_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_rect_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_rect_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_rect_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_rect_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_rect_t>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_rect_t>())).height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(height)
        )
    );
}
#[doc = ""]
pub type cef_rect_t = _cef_rect_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_size_t {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_size_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_size_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_size_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_size_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_size_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_size_t>())).width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_size_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_size_t>())).height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_size_t),
            "::",
            stringify!(height)
        )
    );
}
#[doc = ""]
pub type cef_size_t = _cef_size_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_range_t {
    pub from: ::std::os::raw::c_int,
    pub to: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_range_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_range_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_range_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_range_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_range_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_range_t>())).from as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_range_t),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_range_t>())).to as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_range_t),
            "::",
            stringify!(to)
        )
    );
}
#[doc = ""]
pub type cef_range_t = _cef_range_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_insets_t {
    pub top: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_insets_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_insets_t>(),
        16usize,
        concat!("Size of: ", stringify!(_cef_insets_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_insets_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_insets_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_insets_t>())).top as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_insets_t>())).left as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_insets_t>())).bottom as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_insets_t>())).right as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(right)
        )
    );
}
#[doc = ""]
pub type cef_insets_t = _cef_insets_t;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_draggable_region_t {
    #[doc = ""]
    pub bounds: cef_rect_t,
    #[doc = ""]
    pub draggable: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_draggable_region_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_draggable_region_t>(),
        20usize,
        concat!("Size of: ", stringify!(_cef_draggable_region_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_draggable_region_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_draggable_region_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_draggable_region_t>())).bounds as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_draggable_region_t),
            "::",
            stringify!(bounds)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_draggable_region_t>())).draggable as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_draggable_region_t),
            "::",
            stringify!(draggable)
        )
    );
}
#[doc = ""]
pub type cef_draggable_region_t = _cef_draggable_region_t;
pub mod cef_process_id_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const PID_BROWSER: Type = 0;
    #[doc = ""]
    pub const PID_RENDERER: Type = 1;
}
pub mod cef_thread_id_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const TID_UI: Type = 0;
    #[doc = ""]
    pub const TID_FILE_BACKGROUND: Type = 1;
    #[doc = ""]
    pub const TID_FILE: Type = 1;
    #[doc = ""]
    pub const TID_FILE_USER_VISIBLE: Type = 2;
    #[doc = ""]
    pub const TID_FILE_USER_BLOCKING: Type = 3;
    #[doc = ""]
    pub const TID_PROCESS_LAUNCHER: Type = 4;
    #[doc = ""]
    pub const TID_IO: Type = 5;
    #[doc = ""]
    pub const TID_RENDERER: Type = 6;
}
pub mod cef_thread_priority_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const TP_BACKGROUND: Type = 0;
    #[doc = ""]
    pub const TP_NORMAL: Type = 1;
    #[doc = ""]
    pub const TP_DISPLAY: Type = 2;
    #[doc = ""]
    pub const TP_REALTIME_AUDIO: Type = 3;
}
pub mod cef_message_loop_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const ML_TYPE_DEFAULT: Type = 0;
    #[doc = ""]
    pub const ML_TYPE_UI: Type = 1;
    #[doc = ""]
    pub const ML_TYPE_IO: Type = 2;
}
pub mod cef_com_init_mode_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const COM_INIT_MODE_NONE: Type = 0;
    #[doc = ""]
    pub const COM_INIT_MODE_STA: Type = 1;
    #[doc = ""]
    pub const COM_INIT_MODE_MTA: Type = 2;
}
pub mod cef_value_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const VTYPE_INVALID: Type = 0;
    pub const VTYPE_NULL: Type = 1;
    pub const VTYPE_BOOL: Type = 2;
    pub const VTYPE_INT: Type = 3;
    pub const VTYPE_DOUBLE: Type = 4;
    pub const VTYPE_STRING: Type = 5;
    pub const VTYPE_BINARY: Type = 6;
    pub const VTYPE_DICTIONARY: Type = 7;
    pub const VTYPE_LIST: Type = 8;
}
pub mod cef_jsdialog_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const JSDIALOGTYPE_ALERT: Type = 0;
    pub const JSDIALOGTYPE_CONFIRM: Type = 1;
    pub const JSDIALOGTYPE_PROMPT: Type = 2;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_screen_info_t {
    #[doc = ""]
    pub device_scale_factor: f32,
    #[doc = ""]
    pub depth: ::std::os::raw::c_int,
    #[doc = ""]
    pub depth_per_component: ::std::os::raw::c_int,
    #[doc = ""]
    pub is_monochrome: ::std::os::raw::c_int,
    #[doc = ""]
    pub rect: cef_rect_t,
    #[doc = ""]
    pub available_rect: cef_rect_t,
}
#[test]
fn bindgen_test_layout__cef_screen_info_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_screen_info_t>(),
        48usize,
        concat!("Size of: ", stringify!(_cef_screen_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_screen_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_screen_info_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_screen_info_t>())).device_scale_factor as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(device_scale_factor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_screen_info_t>())).depth as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_screen_info_t>())).depth_per_component as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(depth_per_component)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_screen_info_t>())).is_monochrome as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(is_monochrome)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_screen_info_t>())).rect as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(rect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_screen_info_t>())).available_rect as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(available_rect)
        )
    );
}
#[doc = ""]
pub type cef_screen_info_t = _cef_screen_info_t;
pub mod cef_menu_id_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const MENU_ID_BACK: Type = 100;
    pub const MENU_ID_FORWARD: Type = 101;
    pub const MENU_ID_RELOAD: Type = 102;
    pub const MENU_ID_RELOAD_NOCACHE: Type = 103;
    pub const MENU_ID_STOPLOAD: Type = 104;
    pub const MENU_ID_UNDO: Type = 110;
    pub const MENU_ID_REDO: Type = 111;
    pub const MENU_ID_CUT: Type = 112;
    pub const MENU_ID_COPY: Type = 113;
    pub const MENU_ID_PASTE: Type = 114;
    pub const MENU_ID_DELETE: Type = 115;
    pub const MENU_ID_SELECT_ALL: Type = 116;
    pub const MENU_ID_FIND: Type = 130;
    pub const MENU_ID_PRINT: Type = 131;
    pub const MENU_ID_VIEW_SOURCE: Type = 132;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_0: Type = 200;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_1: Type = 201;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_2: Type = 202;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_3: Type = 203;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_4: Type = 204;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_LAST: Type = 204;
    pub const MENU_ID_NO_SPELLING_SUGGESTIONS: Type = 205;
    pub const MENU_ID_ADD_TO_DICTIONARY: Type = 206;
    pub const MENU_ID_CUSTOM_FIRST: Type = 220;
    pub const MENU_ID_CUSTOM_LAST: Type = 250;
    pub const MENU_ID_USER_FIRST: Type = 26500;
    pub const MENU_ID_USER_LAST: Type = 28500;
}
pub mod cef_mouse_button_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const MBT_LEFT: Type = 0;
    pub const MBT_MIDDLE: Type = 1;
    pub const MBT_RIGHT: Type = 2;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_mouse_event_t {
    #[doc = ""]
    pub x: ::std::os::raw::c_int,
    #[doc = ""]
    pub y: ::std::os::raw::c_int,
    #[doc = ""]
    pub modifiers: uint32,
}
#[test]
fn bindgen_test_layout__cef_mouse_event_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_mouse_event_t>(),
        12usize,
        concat!("Size of: ", stringify!(_cef_mouse_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_mouse_event_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_mouse_event_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_mouse_event_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_mouse_event_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_mouse_event_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_mouse_event_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_mouse_event_t>())).modifiers as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_mouse_event_t),
            "::",
            stringify!(modifiers)
        )
    );
}
#[doc = ""]
pub type cef_mouse_event_t = _cef_mouse_event_t;
pub mod cef_touch_event_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TET_RELEASED: Type = 0;
    pub const CEF_TET_PRESSED: Type = 1;
    pub const CEF_TET_MOVED: Type = 2;
    pub const CEF_TET_CANCELLED: Type = 3;
}
pub mod cef_pointer_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_POINTER_TYPE_TOUCH: Type = 0;
    pub const CEF_POINTER_TYPE_MOUSE: Type = 1;
    pub const CEF_POINTER_TYPE_PEN: Type = 2;
    pub const CEF_POINTER_TYPE_ERASER: Type = 3;
    pub const CEF_POINTER_TYPE_UNKNOWN: Type = 4;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_touch_event_t {
    #[doc = ""]
    pub id: ::std::os::raw::c_int,
    #[doc = ""]
    pub x: f32,
    #[doc = ""]
    pub y: f32,
    #[doc = ""]
    pub radius_x: f32,
    #[doc = ""]
    pub radius_y: f32,
    #[doc = ""]
    pub rotation_angle: f32,
    #[doc = ""]
    pub pressure: f32,
    #[doc = ""]
    pub type_: cef_touch_event_type_t::Type,
    #[doc = ""]
    pub modifiers: uint32,
    #[doc = ""]
    pub pointer_type: cef_pointer_type_t::Type,
}
#[test]
fn bindgen_test_layout__cef_touch_event_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_touch_event_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_touch_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_touch_event_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_touch_event_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).x as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).radius_x as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(radius_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).radius_y as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(radius_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_touch_event_t>())).rotation_angle as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(rotation_angle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).pressure as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(pressure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).type_ as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).modifiers as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(modifiers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_touch_event_t>())).pointer_type as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(pointer_type)
        )
    );
}
#[doc = ""]
pub type cef_touch_event_t = _cef_touch_event_t;
pub mod cef_paint_element_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const PET_VIEW: Type = 0;
    pub const PET_POPUP: Type = 1;
}
pub mod cef_event_flags_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const EVENTFLAG_NONE: Type = 0;
    pub const EVENTFLAG_CAPS_LOCK_ON: Type = 1;
    pub const EVENTFLAG_SHIFT_DOWN: Type = 2;
    pub const EVENTFLAG_CONTROL_DOWN: Type = 4;
    pub const EVENTFLAG_ALT_DOWN: Type = 8;
    pub const EVENTFLAG_LEFT_MOUSE_BUTTON: Type = 16;
    pub const EVENTFLAG_MIDDLE_MOUSE_BUTTON: Type = 32;
    pub const EVENTFLAG_RIGHT_MOUSE_BUTTON: Type = 64;
    pub const EVENTFLAG_COMMAND_DOWN: Type = 128;
    pub const EVENTFLAG_NUM_LOCK_ON: Type = 256;
    pub const EVENTFLAG_IS_KEY_PAD: Type = 512;
    pub const EVENTFLAG_IS_LEFT: Type = 1024;
    pub const EVENTFLAG_IS_RIGHT: Type = 2048;
    pub const EVENTFLAG_ALTGR_DOWN: Type = 4096;
}
pub mod cef_menu_item_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const MENUITEMTYPE_NONE: Type = 0;
    pub const MENUITEMTYPE_COMMAND: Type = 1;
    pub const MENUITEMTYPE_CHECK: Type = 2;
    pub const MENUITEMTYPE_RADIO: Type = 3;
    pub const MENUITEMTYPE_SEPARATOR: Type = 4;
    pub const MENUITEMTYPE_SUBMENU: Type = 5;
}
pub mod cef_context_menu_type_flags_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CM_TYPEFLAG_NONE: Type = 0;
    #[doc = ""]
    pub const CM_TYPEFLAG_PAGE: Type = 1;
    #[doc = ""]
    pub const CM_TYPEFLAG_FRAME: Type = 2;
    #[doc = ""]
    pub const CM_TYPEFLAG_LINK: Type = 4;
    #[doc = ""]
    pub const CM_TYPEFLAG_MEDIA: Type = 8;
    #[doc = ""]
    pub const CM_TYPEFLAG_SELECTION: Type = 16;
    #[doc = ""]
    pub const CM_TYPEFLAG_EDITABLE: Type = 32;
}
pub mod cef_context_menu_media_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CM_MEDIATYPE_NONE: Type = 0;
    #[doc = ""]
    pub const CM_MEDIATYPE_IMAGE: Type = 1;
    #[doc = ""]
    pub const CM_MEDIATYPE_VIDEO: Type = 2;
    #[doc = ""]
    pub const CM_MEDIATYPE_AUDIO: Type = 3;
    #[doc = ""]
    pub const CM_MEDIATYPE_FILE: Type = 4;
    #[doc = ""]
    pub const CM_MEDIATYPE_PLUGIN: Type = 5;
}
pub mod cef_context_menu_media_state_flags_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CM_MEDIAFLAG_NONE: Type = 0;
    pub const CM_MEDIAFLAG_ERROR: Type = 1;
    pub const CM_MEDIAFLAG_PAUSED: Type = 2;
    pub const CM_MEDIAFLAG_MUTED: Type = 4;
    pub const CM_MEDIAFLAG_LOOP: Type = 8;
    pub const CM_MEDIAFLAG_CAN_SAVE: Type = 16;
    pub const CM_MEDIAFLAG_HAS_AUDIO: Type = 32;
    pub const CM_MEDIAFLAG_HAS_VIDEO: Type = 64;
    pub const CM_MEDIAFLAG_CONTROL_ROOT_ELEMENT: Type = 128;
    pub const CM_MEDIAFLAG_CAN_PRINT: Type = 256;
    pub const CM_MEDIAFLAG_CAN_ROTATE: Type = 512;
}
pub mod cef_context_menu_edit_state_flags_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CM_EDITFLAG_NONE: Type = 0;
    pub const CM_EDITFLAG_CAN_UNDO: Type = 1;
    pub const CM_EDITFLAG_CAN_REDO: Type = 2;
    pub const CM_EDITFLAG_CAN_CUT: Type = 4;
    pub const CM_EDITFLAG_CAN_COPY: Type = 8;
    pub const CM_EDITFLAG_CAN_PASTE: Type = 16;
    pub const CM_EDITFLAG_CAN_DELETE: Type = 32;
    pub const CM_EDITFLAG_CAN_SELECT_ALL: Type = 64;
    pub const CM_EDITFLAG_CAN_TRANSLATE: Type = 128;
}
pub mod cef_key_event_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const KEYEVENT_RAWKEYDOWN: Type = 0;
    #[doc = ""]
    pub const KEYEVENT_KEYDOWN: Type = 1;
    #[doc = ""]
    pub const KEYEVENT_KEYUP: Type = 2;
    #[doc = ""]
    pub const KEYEVENT_CHAR: Type = 3;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_key_event_t {
    #[doc = ""]
    pub type_: cef_key_event_type_t::Type,
    #[doc = ""]
    pub modifiers: uint32,
    #[doc = ""]
    pub windows_key_code: ::std::os::raw::c_int,
    #[doc = ""]
    pub native_key_code: ::std::os::raw::c_int,
    #[doc = ""]
    pub is_system_key: ::std::os::raw::c_int,
    #[doc = ""]
    pub character: char16,
    #[doc = ""]
    pub unmodified_character: char16,
    #[doc = ""]
    pub focus_on_editable_field: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_key_event_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_key_event_t>(),
        28usize,
        concat!("Size of: ", stringify!(_cef_key_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_key_event_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_key_event_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_key_event_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_key_event_t>())).modifiers as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(modifiers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_key_event_t>())).windows_key_code as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(windows_key_code)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_key_event_t>())).native_key_code as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(native_key_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_key_event_t>())).is_system_key as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(is_system_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_key_event_t>())).character as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(character)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_key_event_t>())).unmodified_character as *const _ as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(unmodified_character)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_key_event_t>())).focus_on_editable_field as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(focus_on_editable_field)
        )
    );
}
#[doc = ""]
pub type cef_key_event_t = _cef_key_event_t;
pub mod cef_focus_source_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const FOCUS_SOURCE_NAVIGATION: Type = 0;
    #[doc = ""]
    pub const FOCUS_SOURCE_SYSTEM: Type = 1;
}
pub mod cef_navigation_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const NAVIGATION_LINK_CLICKED: Type = 0;
    pub const NAVIGATION_FORM_SUBMITTED: Type = 1;
    pub const NAVIGATION_BACK_FORWARD: Type = 2;
    pub const NAVIGATION_RELOAD: Type = 3;
    pub const NAVIGATION_FORM_RESUBMITTED: Type = 4;
    pub const NAVIGATION_OTHER: Type = 5;
}
pub mod cef_xml_encoding_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const XML_ENCODING_NONE: Type = 0;
    pub const XML_ENCODING_UTF8: Type = 1;
    pub const XML_ENCODING_UTF16LE: Type = 2;
    pub const XML_ENCODING_UTF16BE: Type = 3;
    pub const XML_ENCODING_ASCII: Type = 4;
}
pub mod cef_xml_node_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const XML_NODE_UNSUPPORTED: Type = 0;
    pub const XML_NODE_PROCESSING_INSTRUCTION: Type = 1;
    pub const XML_NODE_DOCUMENT_TYPE: Type = 2;
    pub const XML_NODE_ELEMENT_START: Type = 3;
    pub const XML_NODE_ELEMENT_END: Type = 4;
    pub const XML_NODE_ATTRIBUTE: Type = 5;
    pub const XML_NODE_TEXT: Type = 6;
    pub const XML_NODE_CDATA: Type = 7;
    pub const XML_NODE_ENTITY_REFERENCE: Type = 8;
    pub const XML_NODE_WHITESPACE: Type = 9;
    pub const XML_NODE_COMMENT: Type = 10;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_popup_features_t {
    pub x: ::std::os::raw::c_int,
    pub xSet: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub ySet: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub widthSet: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub heightSet: ::std::os::raw::c_int,
    pub menuBarVisible: ::std::os::raw::c_int,
    pub statusBarVisible: ::std::os::raw::c_int,
    pub toolBarVisible: ::std::os::raw::c_int,
    pub scrollbarsVisible: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_popup_features_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_popup_features_t>(),
        48usize,
        concat!("Size of: ", stringify!(_cef_popup_features_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_popup_features_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_popup_features_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).xSet as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(xSet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).ySet as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(ySet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).width as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).widthSet as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(widthSet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).height as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_popup_features_t>())).heightSet as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(heightSet)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_popup_features_t>())).menuBarVisible as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(menuBarVisible)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_popup_features_t>())).statusBarVisible as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(statusBarVisible)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_popup_features_t>())).toolBarVisible as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(toolBarVisible)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_popup_features_t>())).scrollbarsVisible as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(scrollbarsVisible)
        )
    );
}
#[doc = ""]
pub type cef_popup_features_t = _cef_popup_features_t;
pub mod cef_dom_document_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_DOCUMENT_TYPE_UNKNOWN: Type = 0;
    pub const DOM_DOCUMENT_TYPE_HTML: Type = 1;
    pub const DOM_DOCUMENT_TYPE_XHTML: Type = 2;
    pub const DOM_DOCUMENT_TYPE_PLUGIN: Type = 3;
}
pub mod cef_dom_event_category_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_EVENT_CATEGORY_UNKNOWN: Type = 0;
    pub const DOM_EVENT_CATEGORY_UI: Type = 1;
    pub const DOM_EVENT_CATEGORY_MOUSE: Type = 2;
    pub const DOM_EVENT_CATEGORY_MUTATION: Type = 4;
    pub const DOM_EVENT_CATEGORY_KEYBOARD: Type = 8;
    pub const DOM_EVENT_CATEGORY_TEXT: Type = 16;
    pub const DOM_EVENT_CATEGORY_COMPOSITION: Type = 32;
    pub const DOM_EVENT_CATEGORY_DRAG: Type = 64;
    pub const DOM_EVENT_CATEGORY_CLIPBOARD: Type = 128;
    pub const DOM_EVENT_CATEGORY_MESSAGE: Type = 256;
    pub const DOM_EVENT_CATEGORY_WHEEL: Type = 512;
    pub const DOM_EVENT_CATEGORY_BEFORE_TEXT_INSERTED: Type = 1024;
    pub const DOM_EVENT_CATEGORY_OVERFLOW: Type = 2048;
    pub const DOM_EVENT_CATEGORY_PAGE_TRANSITION: Type = 4096;
    pub const DOM_EVENT_CATEGORY_POPSTATE: Type = 8192;
    pub const DOM_EVENT_CATEGORY_PROGRESS: Type = 16384;
    pub const DOM_EVENT_CATEGORY_XMLHTTPREQUEST_PROGRESS: Type = 32768;
}
pub mod cef_dom_event_phase_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_EVENT_PHASE_UNKNOWN: Type = 0;
    pub const DOM_EVENT_PHASE_CAPTURING: Type = 1;
    pub const DOM_EVENT_PHASE_AT_TARGET: Type = 2;
    pub const DOM_EVENT_PHASE_BUBBLING: Type = 3;
}
pub mod cef_dom_node_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_NODE_TYPE_UNSUPPORTED: Type = 0;
    pub const DOM_NODE_TYPE_ELEMENT: Type = 1;
    pub const DOM_NODE_TYPE_ATTRIBUTE: Type = 2;
    pub const DOM_NODE_TYPE_TEXT: Type = 3;
    pub const DOM_NODE_TYPE_CDATA_SECTION: Type = 4;
    pub const DOM_NODE_TYPE_PROCESSING_INSTRUCTIONS: Type = 5;
    pub const DOM_NODE_TYPE_COMMENT: Type = 6;
    pub const DOM_NODE_TYPE_DOCUMENT: Type = 7;
    pub const DOM_NODE_TYPE_DOCUMENT_TYPE: Type = 8;
    pub const DOM_NODE_TYPE_DOCUMENT_FRAGMENT: Type = 9;
}
pub mod cef_file_dialog_mode_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const FILE_DIALOG_OPEN: Type = 0;
    #[doc = ""]
    pub const FILE_DIALOG_OPEN_MULTIPLE: Type = 1;
    #[doc = ""]
    pub const FILE_DIALOG_OPEN_FOLDER: Type = 2;
    #[doc = ""]
    pub const FILE_DIALOG_SAVE: Type = 3;
    #[doc = ""]
    pub const FILE_DIALOG_TYPE_MASK: Type = 255;
    #[doc = ""]
    pub const FILE_DIALOG_OVERWRITEPROMPT_FLAG: Type = 16777216;
    #[doc = ""]
    pub const FILE_DIALOG_HIDEREADONLY_FLAG: Type = 33554432;
}
pub mod cef_color_model_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const COLOR_MODEL_UNKNOWN: Type = 0;
    pub const COLOR_MODEL_GRAY: Type = 1;
    pub const COLOR_MODEL_COLOR: Type = 2;
    pub const COLOR_MODEL_CMYK: Type = 3;
    pub const COLOR_MODEL_CMY: Type = 4;
    pub const COLOR_MODEL_KCMY: Type = 5;
    pub const COLOR_MODEL_CMY_K: Type = 6;
    pub const COLOR_MODEL_BLACK: Type = 7;
    pub const COLOR_MODEL_GRAYSCALE: Type = 8;
    pub const COLOR_MODEL_RGB: Type = 9;
    pub const COLOR_MODEL_RGB16: Type = 10;
    pub const COLOR_MODEL_RGBA: Type = 11;
    pub const COLOR_MODEL_COLORMODE_COLOR: Type = 12;
    pub const COLOR_MODEL_COLORMODE_MONOCHROME: Type = 13;
    pub const COLOR_MODEL_HP_COLOR_COLOR: Type = 14;
    pub const COLOR_MODEL_HP_COLOR_BLACK: Type = 15;
    pub const COLOR_MODEL_PRINTOUTMODE_NORMAL: Type = 16;
    pub const COLOR_MODEL_PRINTOUTMODE_NORMAL_GRAY: Type = 17;
    pub const COLOR_MODEL_PROCESSCOLORMODEL_CMYK: Type = 18;
    pub const COLOR_MODEL_PROCESSCOLORMODEL_GREYSCALE: Type = 19;
    pub const COLOR_MODEL_PROCESSCOLORMODEL_RGB: Type = 20;
}
pub mod cef_duplex_mode_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const DUPLEX_MODE_UNKNOWN: Type = -1;
    pub const DUPLEX_MODE_SIMPLEX: Type = 0;
    pub const DUPLEX_MODE_LONG_EDGE: Type = 1;
    pub const DUPLEX_MODE_SHORT_EDGE: Type = 2;
}
pub mod cef_cursor_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CT_POINTER: Type = 0;
    pub const CT_CROSS: Type = 1;
    pub const CT_HAND: Type = 2;
    pub const CT_IBEAM: Type = 3;
    pub const CT_WAIT: Type = 4;
    pub const CT_HELP: Type = 5;
    pub const CT_EASTRESIZE: Type = 6;
    pub const CT_NORTHRESIZE: Type = 7;
    pub const CT_NORTHEASTRESIZE: Type = 8;
    pub const CT_NORTHWESTRESIZE: Type = 9;
    pub const CT_SOUTHRESIZE: Type = 10;
    pub const CT_SOUTHEASTRESIZE: Type = 11;
    pub const CT_SOUTHWESTRESIZE: Type = 12;
    pub const CT_WESTRESIZE: Type = 13;
    pub const CT_NORTHSOUTHRESIZE: Type = 14;
    pub const CT_EASTWESTRESIZE: Type = 15;
    pub const CT_NORTHEASTSOUTHWESTRESIZE: Type = 16;
    pub const CT_NORTHWESTSOUTHEASTRESIZE: Type = 17;
    pub const CT_COLUMNRESIZE: Type = 18;
    pub const CT_ROWRESIZE: Type = 19;
    pub const CT_MIDDLEPANNING: Type = 20;
    pub const CT_EASTPANNING: Type = 21;
    pub const CT_NORTHPANNING: Type = 22;
    pub const CT_NORTHEASTPANNING: Type = 23;
    pub const CT_NORTHWESTPANNING: Type = 24;
    pub const CT_SOUTHPANNING: Type = 25;
    pub const CT_SOUTHEASTPANNING: Type = 26;
    pub const CT_SOUTHWESTPANNING: Type = 27;
    pub const CT_WESTPANNING: Type = 28;
    pub const CT_MOVE: Type = 29;
    pub const CT_VERTICALTEXT: Type = 30;
    pub const CT_CELL: Type = 31;
    pub const CT_CONTEXTMENU: Type = 32;
    pub const CT_ALIAS: Type = 33;
    pub const CT_PROGRESS: Type = 34;
    pub const CT_NODROP: Type = 35;
    pub const CT_COPY: Type = 36;
    pub const CT_NONE: Type = 37;
    pub const CT_NOTALLOWED: Type = 38;
    pub const CT_ZOOMIN: Type = 39;
    pub const CT_ZOOMOUT: Type = 40;
    pub const CT_GRAB: Type = 41;
    pub const CT_GRABBING: Type = 42;
    pub const CT_MIDDLE_PANNING_VERTICAL: Type = 43;
    pub const CT_MIDDLE_PANNING_HORIZONTAL: Type = 44;
    pub const CT_CUSTOM: Type = 45;
    pub const CT_DND_NONE: Type = 46;
    pub const CT_DND_MOVE: Type = 47;
    pub const CT_DND_COPY: Type = 48;
    pub const CT_DND_LINK: Type = 49;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cursor_info_t {
    pub hotspot: cef_point_t,
    pub image_scale_factor: f32,
    pub buffer: *mut ::std::os::raw::c_void,
    pub size: cef_size_t,
}
#[test]
fn bindgen_test_layout__cef_cursor_info_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_cursor_info_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_cursor_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_cursor_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_cursor_info_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cursor_info_t>())).hotspot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(hotspot)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_cursor_info_t>())).image_scale_factor as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(image_scale_factor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cursor_info_t>())).buffer as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_cursor_info_t>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(size)
        )
    );
}
#[doc = ""]
pub type cef_cursor_info_t = _cef_cursor_info_t;
pub mod cef_uri_unescape_rule_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const UU_NONE: Type = 0;
    #[doc = ""]
    pub const UU_NORMAL: Type = 1;
    #[doc = ""]
    pub const UU_SPACES: Type = 2;
    #[doc = ""]
    pub const UU_PATH_SEPARATORS: Type = 4;
    #[doc = ""]
    pub const UU_URL_SPECIAL_CHARS_EXCEPT_PATH_SEPARATORS: Type = 8;
    #[doc = ""]
    pub const UU_REPLACE_PLUS_WITH_SPACE: Type = 16;
}
pub mod cef_json_parser_options_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const JSON_PARSER_RFC: Type = 0;
    #[doc = ""]
    pub const JSON_PARSER_ALLOW_TRAILING_COMMAS: Type = 1;
}
pub mod cef_json_writer_options_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const JSON_WRITER_DEFAULT: Type = 0;
    #[doc = ""]
    pub const JSON_WRITER_OMIT_BINARY_VALUES: Type = 1;
    #[doc = ""]
    pub const JSON_WRITER_OMIT_DOUBLE_TYPE_PRESERVATION: Type = 2;
    #[doc = ""]
    pub const JSON_WRITER_PRETTY_PRINT: Type = 4;
}
pub mod cef_pdf_print_margin_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const PDF_PRINT_MARGIN_DEFAULT: Type = 0;
    #[doc = ""]
    pub const PDF_PRINT_MARGIN_NONE: Type = 1;
    #[doc = ""]
    pub const PDF_PRINT_MARGIN_MINIMUM: Type = 2;
    #[doc = ""]
    pub const PDF_PRINT_MARGIN_CUSTOM: Type = 3;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_pdf_print_settings_t {
    #[doc = ""]
    pub header_footer_title: cef_string_t,
    #[doc = ""]
    pub header_footer_url: cef_string_t,
    #[doc = ""]
    pub page_width: ::std::os::raw::c_int,
    pub page_height: ::std::os::raw::c_int,
    #[doc = ""]
    pub scale_factor: ::std::os::raw::c_int,
    #[doc = ""]
    pub margin_top: ::std::os::raw::c_int,
    pub margin_right: ::std::os::raw::c_int,
    pub margin_bottom: ::std::os::raw::c_int,
    pub margin_left: ::std::os::raw::c_int,
    #[doc = ""]
    pub margin_type: cef_pdf_print_margin_type_t::Type,
    #[doc = ""]
    pub header_footer_enabled: ::std::os::raw::c_int,
    #[doc = ""]
    pub selection_only: ::std::os::raw::c_int,
    #[doc = ""]
    pub landscape: ::std::os::raw::c_int,
    #[doc = ""]
    pub backgrounds_enabled: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_pdf_print_settings_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_pdf_print_settings_t>(),
        72usize,
        concat!("Size of: ", stringify!(_cef_pdf_print_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_pdf_print_settings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_pdf_print_settings_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).header_footer_title as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(header_footer_title)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).header_footer_url as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(header_footer_url)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).page_width as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(page_width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).page_height as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(page_height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).scale_factor as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(scale_factor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).margin_top as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).margin_right as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_right)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).margin_bottom as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_bottom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).margin_left as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).margin_type as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).header_footer_enabled as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(header_footer_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).selection_only as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(selection_only)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).landscape as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(landscape)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_pdf_print_settings_t>())).backgrounds_enabled as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(backgrounds_enabled)
        )
    );
}
#[doc = ""]
pub type cef_pdf_print_settings_t = _cef_pdf_print_settings_t;
pub mod cef_scale_factor_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const SCALE_FACTOR_NONE: Type = 0;
    pub const SCALE_FACTOR_100P: Type = 1;
    pub const SCALE_FACTOR_125P: Type = 2;
    pub const SCALE_FACTOR_133P: Type = 3;
    pub const SCALE_FACTOR_140P: Type = 4;
    pub const SCALE_FACTOR_150P: Type = 5;
    pub const SCALE_FACTOR_180P: Type = 6;
    pub const SCALE_FACTOR_200P: Type = 7;
    pub const SCALE_FACTOR_250P: Type = 8;
    pub const SCALE_FACTOR_300P: Type = 9;
}
pub mod cef_plugin_policy_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const PLUGIN_POLICY_ALLOW: Type = 0;
    #[doc = ""]
    pub const PLUGIN_POLICY_DETECT_IMPORTANT: Type = 1;
    #[doc = ""]
    pub const PLUGIN_POLICY_BLOCK: Type = 2;
    #[doc = ""]
    pub const PLUGIN_POLICY_DISABLE: Type = 3;
}
pub mod cef_referrer_policy_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_FROM_SECURE_TO_INSECURE: Type = 0;
    #[doc = ""]
    pub const REFERRER_POLICY_DEFAULT: Type = 0;
    #[doc = ""]
    pub const REFERRER_POLICY_REDUCE_REFERRER_GRANULARITY_ON_TRANSITION_CROSS_ORIGIN: Type = 1;
    #[doc = ""]
    pub const REFERRER_POLICY_ORIGIN_ONLY_ON_TRANSITION_CROSS_ORIGIN: Type = 2;
    #[doc = ""]
    pub const REFERRER_POLICY_NEVER_CLEAR_REFERRER: Type = 3;
    #[doc = ""]
    pub const REFERRER_POLICY_ORIGIN: Type = 4;
    #[doc = ""]
    pub const REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_CROSS_ORIGIN: Type = 5;
    #[doc = ""]
    pub const REFERRER_POLICY_ORIGIN_CLEAR_ON_TRANSITION_FROM_SECURE_TO_INSECURE: Type = 6;
    #[doc = ""]
    pub const REFERRER_POLICY_NO_REFERRER: Type = 7;
    #[doc = ""]
    pub const REFERRER_POLICY_LAST_VALUE: Type = 7;
}
pub mod cef_response_filter_status_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const RESPONSE_FILTER_NEED_MORE_DATA: Type = 0;
    #[doc = ""]
    pub const RESPONSE_FILTER_DONE: Type = 1;
    #[doc = ""]
    pub const RESPONSE_FILTER_ERROR: Type = 2;
}
pub mod cef_color_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CEF_COLOR_TYPE_RGBA_8888: Type = 0;
    #[doc = ""]
    pub const CEF_COLOR_TYPE_BGRA_8888: Type = 1;
}
pub mod cef_alpha_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CEF_ALPHA_TYPE_OPAQUE: Type = 0;
    #[doc = ""]
    pub const CEF_ALPHA_TYPE_PREMULTIPLIED: Type = 1;
    #[doc = ""]
    pub const CEF_ALPHA_TYPE_POSTMULTIPLIED: Type = 2;
}
pub mod cef_text_style_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TEXT_STYLE_BOLD: Type = 0;
    pub const CEF_TEXT_STYLE_ITALIC: Type = 1;
    pub const CEF_TEXT_STYLE_STRIKE: Type = 2;
    pub const CEF_TEXT_STYLE_DIAGONAL_STRIKE: Type = 3;
    pub const CEF_TEXT_STYLE_UNDERLINE: Type = 4;
}
pub mod cef_main_axis_alignment_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CEF_MAIN_AXIS_ALIGNMENT_START: Type = 0;
    #[doc = ""]
    pub const CEF_MAIN_AXIS_ALIGNMENT_CENTER: Type = 1;
    #[doc = ""]
    pub const CEF_MAIN_AXIS_ALIGNMENT_END: Type = 2;
}
pub mod cef_cross_axis_alignment_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CEF_CROSS_AXIS_ALIGNMENT_STRETCH: Type = 0;
    #[doc = ""]
    pub const CEF_CROSS_AXIS_ALIGNMENT_START: Type = 1;
    #[doc = ""]
    pub const CEF_CROSS_AXIS_ALIGNMENT_CENTER: Type = 2;
    #[doc = ""]
    pub const CEF_CROSS_AXIS_ALIGNMENT_END: Type = 3;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_box_layout_settings_t {
    #[doc = ""]
    pub horizontal: ::std::os::raw::c_int,
    #[doc = ""]
    pub inside_border_horizontal_spacing: ::std::os::raw::c_int,
    #[doc = ""]
    pub inside_border_vertical_spacing: ::std::os::raw::c_int,
    #[doc = ""]
    pub inside_border_insets: cef_insets_t,
    #[doc = ""]
    pub between_child_spacing: ::std::os::raw::c_int,
    #[doc = ""]
    pub main_axis_alignment: cef_main_axis_alignment_t::Type,
    #[doc = ""]
    pub cross_axis_alignment: cef_cross_axis_alignment_t::Type,
    #[doc = ""]
    pub minimum_cross_axis_size: ::std::os::raw::c_int,
    #[doc = ""]
    pub default_flex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_box_layout_settings_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_box_layout_settings_t>(),
        48usize,
        concat!("Size of: ", stringify!(_cef_box_layout_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_box_layout_settings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_box_layout_settings_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).horizontal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(horizontal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).inside_border_horizontal_spacing
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(inside_border_horizontal_spacing)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).inside_border_vertical_spacing
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(inside_border_vertical_spacing)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).inside_border_insets as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(inside_border_insets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).between_child_spacing as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(between_child_spacing)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).main_axis_alignment as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(main_axis_alignment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).cross_axis_alignment as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(cross_axis_alignment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).minimum_cross_axis_size
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(minimum_cross_axis_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_box_layout_settings_t>())).default_flex as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(default_flex)
        )
    );
}
#[doc = ""]
pub type cef_box_layout_settings_t = _cef_box_layout_settings_t;
pub mod cef_button_state_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_BUTTON_STATE_NORMAL: Type = 0;
    pub const CEF_BUTTON_STATE_HOVERED: Type = 1;
    pub const CEF_BUTTON_STATE_PRESSED: Type = 2;
    pub const CEF_BUTTON_STATE_DISABLED: Type = 3;
}
pub mod cef_horizontal_alignment_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CEF_HORIZONTAL_ALIGNMENT_LEFT: Type = 0;
    #[doc = ""]
    pub const CEF_HORIZONTAL_ALIGNMENT_CENTER: Type = 1;
    #[doc = ""]
    pub const CEF_HORIZONTAL_ALIGNMENT_RIGHT: Type = 2;
}
pub mod cef_menu_anchor_position_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MENU_ANCHOR_TOPLEFT: Type = 0;
    pub const CEF_MENU_ANCHOR_TOPRIGHT: Type = 1;
    pub const CEF_MENU_ANCHOR_BOTTOMCENTER: Type = 2;
}
pub mod cef_menu_color_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MENU_COLOR_TEXT: Type = 0;
    pub const CEF_MENU_COLOR_TEXT_HOVERED: Type = 1;
    pub const CEF_MENU_COLOR_TEXT_ACCELERATOR: Type = 2;
    pub const CEF_MENU_COLOR_TEXT_ACCELERATOR_HOVERED: Type = 3;
    pub const CEF_MENU_COLOR_BACKGROUND: Type = 4;
    pub const CEF_MENU_COLOR_BACKGROUND_HOVERED: Type = 5;
    pub const CEF_MENU_COLOR_COUNT: Type = 6;
}
pub mod cef_ssl_version_t {
    pub type Type = ::std::os::raw::c_int;
    pub const SSL_CONNECTION_VERSION_UNKNOWN: Type = 0;
    pub const SSL_CONNECTION_VERSION_SSL2: Type = 1;
    pub const SSL_CONNECTION_VERSION_SSL3: Type = 2;
    pub const SSL_CONNECTION_VERSION_TLS1: Type = 3;
    pub const SSL_CONNECTION_VERSION_TLS1_1: Type = 4;
    pub const SSL_CONNECTION_VERSION_TLS1_2: Type = 5;
    pub const SSL_CONNECTION_VERSION_TLS1_3: Type = 6;
    pub const SSL_CONNECTION_VERSION_QUIC: Type = 7;
}
pub mod cef_ssl_content_status_t {
    pub type Type = ::std::os::raw::c_int;
    pub const SSL_CONTENT_NORMAL_CONTENT: Type = 0;
    pub const SSL_CONTENT_DISPLAYED_INSECURE_CONTENT: Type = 1;
    pub const SSL_CONTENT_RAN_INSECURE_CONTENT: Type = 2;
}
pub mod cef_scheme_options_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_SCHEME_OPTION_NONE: Type = 0;
    #[doc = ""]
    pub const CEF_SCHEME_OPTION_STANDARD: Type = 1;
    #[doc = ""]
    pub const CEF_SCHEME_OPTION_LOCAL: Type = 2;
    #[doc = ""]
    pub const CEF_SCHEME_OPTION_DISPLAY_ISOLATED: Type = 4;
    #[doc = ""]
    pub const CEF_SCHEME_OPTION_SECURE: Type = 8;
    #[doc = ""]
    pub const CEF_SCHEME_OPTION_CORS_ENABLED: Type = 16;
    #[doc = ""]
    pub const CEF_SCHEME_OPTION_CSP_BYPASSING: Type = 32;
    #[doc = ""]
    pub const CEF_SCHEME_OPTION_FETCH_ENABLED: Type = 64;
}
pub mod cef_cdm_registration_error_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    #[doc = ""]
    pub const CEF_CDM_REGISTRATION_ERROR_NONE: Type = 0;
    #[doc = ""]
    pub const CEF_CDM_REGISTRATION_ERROR_INCORRECT_CONTENTS: Type = 1;
    #[doc = ""]
    pub const CEF_CDM_REGISTRATION_ERROR_INCOMPATIBLE: Type = 2;
    #[doc = ""]
    pub const CEF_CDM_REGISTRATION_ERROR_NOT_SUPPORTED: Type = 3;
}
pub mod cef_composition_underline_style_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CUS_SOLID: Type = 0;
    pub const CEF_CUS_DOT: Type = 1;
    pub const CEF_CUS_DASH: Type = 2;
    pub const CEF_CUS_NONE: Type = 3;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_composition_underline_t {
    #[doc = ""]
    pub range: cef_range_t,
    #[doc = ""]
    pub color: cef_color_t,
    #[doc = ""]
    pub background_color: cef_color_t,
    #[doc = ""]
    pub thick: ::std::os::raw::c_int,
    #[doc = ""]
    pub style: cef_composition_underline_style_t::Type,
}
#[test]
fn bindgen_test_layout__cef_composition_underline_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_composition_underline_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_composition_underline_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_composition_underline_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_composition_underline_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_composition_underline_t>())).range as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_composition_underline_t>())).color as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_composition_underline_t>())).background_color as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_composition_underline_t>())).thick as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(thick)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_composition_underline_t>())).style as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(style)
        )
    );
}
#[doc = ""]
pub type cef_composition_underline_t = _cef_composition_underline_t;
pub mod cef_channel_layout_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CHANNEL_LAYOUT_NONE: Type = 0;
    pub const CEF_CHANNEL_LAYOUT_UNSUPPORTED: Type = 1;
    pub const CEF_CHANNEL_LAYOUT_MONO: Type = 2;
    pub const CEF_CHANNEL_LAYOUT_STEREO: Type = 3;
    pub const CEF_CHANNEL_LAYOUT_2_1: Type = 4;
    pub const CEF_CHANNEL_LAYOUT_SURROUND: Type = 5;
    pub const CEF_CHANNEL_LAYOUT_4_0: Type = 6;
    pub const CEF_CHANNEL_LAYOUT_2_2: Type = 7;
    pub const CEF_CHANNEL_LAYOUT_QUAD: Type = 8;
    pub const CEF_CHANNEL_LAYOUT_5_0: Type = 9;
    pub const CEF_CHANNEL_LAYOUT_5_1: Type = 10;
    pub const CEF_CHANNEL_LAYOUT_5_0_BACK: Type = 11;
    pub const CEF_CHANNEL_LAYOUT_5_1_BACK: Type = 12;
    pub const CEF_CHANNEL_LAYOUT_7_0: Type = 13;
    pub const CEF_CHANNEL_LAYOUT_7_1: Type = 14;
    pub const CEF_CHANNEL_LAYOUT_7_1_WIDE: Type = 15;
    pub const CEF_CHANNEL_LAYOUT_STEREO_DOWNMIX: Type = 16;
    pub const CEF_CHANNEL_LAYOUT_2POINT1: Type = 17;
    pub const CEF_CHANNEL_LAYOUT_3_1: Type = 18;
    pub const CEF_CHANNEL_LAYOUT_4_1: Type = 19;
    pub const CEF_CHANNEL_LAYOUT_6_0: Type = 20;
    pub const CEF_CHANNEL_LAYOUT_6_0_FRONT: Type = 21;
    pub const CEF_CHANNEL_LAYOUT_HEXAGONAL: Type = 22;
    pub const CEF_CHANNEL_LAYOUT_6_1: Type = 23;
    pub const CEF_CHANNEL_LAYOUT_6_1_BACK: Type = 24;
    pub const CEF_CHANNEL_LAYOUT_6_1_FRONT: Type = 25;
    pub const CEF_CHANNEL_LAYOUT_7_0_FRONT: Type = 26;
    pub const CEF_CHANNEL_LAYOUT_7_1_WIDE_BACK: Type = 27;
    pub const CEF_CHANNEL_LAYOUT_OCTAGONAL: Type = 28;
    pub const CEF_CHANNEL_LAYOUT_DISCRETE: Type = 29;
    pub const CEF_CHANNEL_LAYOUT_STEREO_AND_KEYBOARD_MIC: Type = 30;
    pub const CEF_CHANNEL_LAYOUT_4_1_QUAD_SIDE: Type = 31;
    pub const CEF_CHANNEL_LAYOUT_BITSTREAM: Type = 32;
    pub const CEF_CHANNEL_LAYOUT_MAX: Type = 32;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_audio_parameters_t {
    #[doc = ""]
    pub channel_layout: cef_channel_layout_t::Type,
    #[doc = ""]
    pub sample_rate: ::std::os::raw::c_int,
    #[doc = ""]
    pub frames_per_buffer: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_audio_parameters_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_audio_parameters_t>(),
        12usize,
        concat!("Size of: ", stringify!(_cef_audio_parameters_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_audio_parameters_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_audio_parameters_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_audio_parameters_t>())).channel_layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_audio_parameters_t),
            "::",
            stringify!(channel_layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_audio_parameters_t>())).sample_rate as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_audio_parameters_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_audio_parameters_t>())).frames_per_buffer as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_audio_parameters_t),
            "::",
            stringify!(frames_per_buffer)
        )
    );
}
#[doc = ""]
pub type cef_audio_parameters_t = _cef_audio_parameters_t;
pub mod cef_media_route_create_result_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MRCR_UNKNOWN_ERROR: Type = 0;
    pub const CEF_MRCR_OK: Type = 1;
    pub const CEF_MRCR_TIMED_OUT: Type = 2;
    pub const CEF_MRCR_ROUTE_NOT_FOUND: Type = 3;
    pub const CEF_MRCR_SINK_NOT_FOUND: Type = 4;
    pub const CEF_MRCR_INVALID_ORIGIN: Type = 5;
    pub const CEF_MRCR_NO_SUPPORTED_PROVIDER: Type = 7;
    pub const CEF_MRCR_CANCELLED: Type = 8;
    pub const CEF_MRCR_ROUTE_ALREADY_EXISTS: Type = 9;
    pub const CEF_MRCR_ROUTE_ALREADY_TERMINATED: Type = 11;
    pub const CEF_MRCR_TOTAL_COUNT: Type = 12;
}
pub mod cef_media_route_connection_state_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MRCS_UNKNOWN: Type = 0;
    pub const CEF_MRCS_CONNECTING: Type = 1;
    pub const CEF_MRCS_CONNECTED: Type = 2;
    pub const CEF_MRCS_CLOSED: Type = 3;
    pub const CEF_MRCS_TERMINATED: Type = 4;
}
pub mod cef_media_sink_icon_type_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MSIT_CAST: Type = 0;
    pub const CEF_MSIT_CAST_AUDIO_GROUP: Type = 1;
    pub const CEF_MSIT_CAST_AUDIO: Type = 2;
    pub const CEF_MSIT_MEETING: Type = 3;
    pub const CEF_MSIT_HANGOUT: Type = 4;
    pub const CEF_MSIT_EDUCATION: Type = 5;
    pub const CEF_MSIT_WIRED_DISPLAY: Type = 6;
    pub const CEF_MSIT_GENERIC: Type = 7;
    pub const CEF_MSIT_TOTAL_COUNT: Type = 8;
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_media_sink_device_info_t {
    pub ip_address: cef_string_t,
    pub port: ::std::os::raw::c_int,
    pub model_name: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_media_sink_device_info_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_media_sink_device_info_t>(),
        28usize,
        concat!("Size of: ", stringify!(_cef_media_sink_device_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_media_sink_device_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_media_sink_device_info_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_media_sink_device_info_t>())).ip_address as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_media_sink_device_info_t),
            "::",
            stringify!(ip_address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_media_sink_device_info_t>())).port as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_media_sink_device_info_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_media_sink_device_info_t>())).model_name as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_media_sink_device_info_t),
            "::",
            stringify!(model_name)
        )
    );
}
#[doc = ""]
pub type cef_media_sink_device_info_t = _cef_media_sink_device_info_t;
pub mod cef_text_field_commands_t {
    #[doc = ""]
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TFC_CUT: Type = 1;
    pub const CEF_TFC_COPY: Type = 2;
    pub const CEF_TFC_PASTE: Type = 3;
    pub const CEF_TFC_UNDO: Type = 4;
    pub const CEF_TFC_DELETE: Type = 5;
    pub const CEF_TFC_SELECT_ALL: Type = 6;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_base_ref_counted_t {
    #[doc = ""]
    pub size: usize,
    #[doc = ""]
    pub add_ref:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_base_ref_counted_t)>,
    #[doc = ""]
    pub release: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub has_one_ref: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub has_at_least_one_ref: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_base_ref_counted_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_base_ref_counted_t>(),
        20usize,
        concat!("Size of: ", stringify!(_cef_base_ref_counted_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_base_ref_counted_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_base_ref_counted_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_base_ref_counted_t>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_base_ref_counted_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_base_ref_counted_t>())).add_ref as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_base_ref_counted_t),
            "::",
            stringify!(add_ref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_base_ref_counted_t>())).release as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_base_ref_counted_t),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_base_ref_counted_t>())).has_one_ref as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_base_ref_counted_t),
            "::",
            stringify!(has_one_ref)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_base_ref_counted_t>())).has_at_least_one_ref as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_base_ref_counted_t),
            "::",
            stringify!(has_at_least_one_ref)
        )
    );
}
#[doc = ""]
pub type cef_base_ref_counted_t = _cef_base_ref_counted_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_base_scoped_t {
    #[doc = ""]
    pub size: usize,
    #[doc = ""]
    pub del: ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_base_scoped_t)>,
}
#[test]
fn bindgen_test_layout__cef_base_scoped_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_base_scoped_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_base_scoped_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_base_scoped_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_base_scoped_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_base_scoped_t>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_base_scoped_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_base_scoped_t>())).del as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_base_scoped_t),
            "::",
            stringify!(del)
        )
    );
}
#[doc = ""]
pub type cef_base_scoped_t = _cef_base_scoped_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_dev_tools_message_observer_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub on_dev_tools_message: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            message: *const ::std::os::raw::c_void,
            message_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub on_dev_tools_method_result: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            message_id: ::std::os::raw::c_int,
            success: ::std::os::raw::c_int,
            result: *const ::std::os::raw::c_void,
            result_size: usize,
        ),
    >,
    #[doc = ""]
    pub on_dev_tools_event: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            method: *const cef_string_t,
            params: *const ::std::os::raw::c_void,
            params_size: usize,
        ),
    >,
    #[doc = ""]
    pub on_dev_tools_agent_attached: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
        ),
    >,
    #[doc = ""]
    pub on_dev_tools_agent_detached: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout__cef_dev_tools_message_observer_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_dev_tools_message_observer_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_dev_tools_message_observer_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_dev_tools_message_observer_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_cef_dev_tools_message_observer_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dev_tools_message_observer_t>())).base as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dev_tools_message_observer_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dev_tools_message_observer_t>())).on_dev_tools_message
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dev_tools_message_observer_t),
            "::",
            stringify!(on_dev_tools_message)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dev_tools_message_observer_t>())).on_dev_tools_method_result
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dev_tools_message_observer_t),
            "::",
            stringify!(on_dev_tools_method_result)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dev_tools_message_observer_t>())).on_dev_tools_event
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dev_tools_message_observer_t),
            "::",
            stringify!(on_dev_tools_event)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dev_tools_message_observer_t>()))
                .on_dev_tools_agent_attached as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dev_tools_message_observer_t),
            "::",
            stringify!(on_dev_tools_agent_attached)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dev_tools_message_observer_t>()))
                .on_dev_tools_agent_detached as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dev_tools_message_observer_t),
            "::",
            stringify!(on_dev_tools_agent_detached)
        )
    );
}
#[doc = ""]
pub type cef_dev_tools_message_observer_t = _cef_dev_tools_message_observer_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_value_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_valid: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_owned: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_same: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            that: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_equal: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            that: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub copy: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> *mut _cef_value_t,
    >,
    #[doc = ""]
    pub get_type: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> cef_value_type_t::Type,
    >,
    #[doc = ""]
    pub get_bool: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_int: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_double:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> f64>,
    #[doc = ""]
    pub get_string: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_binary: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> *mut _cef_binary_value_t,
    >,
    #[doc = ""]
    pub get_dictionary: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = ""]
    pub get_list: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> *mut _cef_list_value_t,
    >,
    #[doc = ""]
    pub set_null: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_bool: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_int: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_double: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_value_t, value: f64) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_string: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_binary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_dictionary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_list: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_value_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_value_t>(),
        108usize,
        concat!("Size of: ", stringify!(_cef_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_value_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_value_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).is_valid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(is_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).is_owned as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(is_owned)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).is_read_only as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).is_same as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(is_same)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).is_equal as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(is_equal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).copy as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_type as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_bool as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_bool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_int as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_int)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_double as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_double)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_string as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_binary as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_binary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_dictionary as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_dictionary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).get_list as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(get_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_null as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_bool as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_bool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_int as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_int)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_double as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_double)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_string as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_binary as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_binary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_dictionary as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_dictionary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_value_t>())).set_list as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_value_t),
            "::",
            stringify!(set_list)
        )
    );
}
#[doc = ""]
pub type cef_value_t = _cef_value_t;
extern "C" {
    #[doc = ""]
    pub fn cef_value_create() -> *mut cef_value_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_binary_value_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_valid: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_binary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_owned: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_binary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_same: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_binary_value_t,
            that: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_equal: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_binary_value_t,
            that: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub copy: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_binary_value_t) -> *mut _cef_binary_value_t,
    >,
    #[doc = ""]
    pub get_size:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_binary_value_t) -> usize>,
    #[doc = ""]
    pub get_data: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_binary_value_t,
            buffer: *mut ::std::os::raw::c_void,
            buffer_size: usize,
            data_offset: usize,
        ) -> usize,
    >,
}
#[test]
fn bindgen_test_layout__cef_binary_value_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_binary_value_t>(),
        48usize,
        concat!("Size of: ", stringify!(_cef_binary_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_binary_value_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_binary_value_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).is_valid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(is_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).is_owned as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(is_owned)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).is_same as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(is_same)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).is_equal as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(is_equal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).copy as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).get_size as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(get_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_binary_value_t>())).get_data as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_binary_value_t),
            "::",
            stringify!(get_data)
        )
    );
}
#[doc = ""]
pub type cef_binary_value_t = _cef_binary_value_t;
extern "C" {
    #[doc = ""]
    pub fn cef_binary_value_create(
        data: *const ::std::os::raw::c_void, data_size: usize,
    ) -> *mut cef_binary_value_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_dictionary_value_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_valid: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_owned: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_same: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            that: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_equal: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            that: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub copy: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            exclude_empty_children: ::std::os::raw::c_int,
        ) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = ""]
    pub get_size: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_dictionary_value_t) -> usize,
    >,
    #[doc = ""]
    pub clear: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub has_key: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_keys: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            keys: cef_string_list_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub remove: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_type: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> cef_value_type_t::Type,
    >,
    #[doc = ""]
    pub get_value: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_value_t,
    >,
    #[doc = ""]
    pub get_bool: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_int: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_double: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> f64,
    >,
    #[doc = ""]
    pub get_string: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_binary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = ""]
    pub get_dictionary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = ""]
    pub get_list: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_list_value_t,
    >,
    #[doc = ""]
    pub set_value: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_null: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_bool: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_int: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_double: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: f64,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_string: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_binary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_dictionary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_list: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_dictionary_value_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_dictionary_value_t>(),
        136usize,
        concat!("Size of: ", stringify!(_cef_dictionary_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_dictionary_value_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_dictionary_value_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).is_valid as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(is_valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).is_owned as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(is_owned)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).is_read_only as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).is_same as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(is_same)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).is_equal as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(is_equal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).copy as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_size as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).clear as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(clear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).has_key as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(has_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_keys as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).remove as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_type as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_value as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_bool as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_bool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_int as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_int)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_double as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_double)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_string as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_binary as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_binary)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_dictionary as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_dictionary)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).get_list as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(get_list)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_value as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_null as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_null)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_bool as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_bool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_int as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_int)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_double as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_double)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_string as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_binary as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_binary)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_dictionary as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_dictionary)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_dictionary_value_t>())).set_list as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_dictionary_value_t),
            "::",
            stringify!(set_list)
        )
    );
}
#[doc = ""]
pub type cef_dictionary_value_t = _cef_dictionary_value_t;
extern "C" {
    #[doc = ""]
    pub fn cef_dictionary_value_create() -> *mut cef_dictionary_value_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_list_value_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_valid: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_owned: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_same: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            that: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_equal: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            that: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub copy: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_list_value_t) -> *mut _cef_list_value_t,
    >,
    #[doc = ""]
    pub set_size: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_size:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_list_value_t) -> usize>,
    #[doc = ""]
    pub clear: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub remove: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_type: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> cef_value_type_t::Type,
    >,
    #[doc = ""]
    pub get_value: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_value_t,
    >,
    #[doc = ""]
    pub get_bool: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_int: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_double: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_list_value_t, index: usize) -> f64,
    >,
    #[doc = ""]
    pub get_string: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_binary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = ""]
    pub get_dictionary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = ""]
    pub get_list: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_list_value_t,
    >,
    #[doc = ""]
    pub set_value: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_null: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_bool: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_int: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_double: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: f64,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_string: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_binary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_dictionary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_list: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_list_value_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_list_value_t>(),
        132usize,
        concat!("Size of: ", stringify!(_cef_list_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_list_value_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_list_value_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).is_valid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(is_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).is_owned as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(is_owned)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).is_read_only as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).is_same as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(is_same)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).is_equal as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(is_equal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).copy as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_size as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).clear as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(clear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).remove as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_type as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_value as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_bool as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_bool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_int as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_int)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_double as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_double)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_string as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_binary as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_binary)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_list_value_t>())).get_dictionary as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_dictionary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).get_list as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(get_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_value as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_null as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_bool as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_bool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_int as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_int)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_double as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_double)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_string as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_binary as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_binary)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_list_value_t>())).set_dictionary as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_dictionary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_list_value_t>())).set_list as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_list_value_t),
            "::",
            stringify!(set_list)
        )
    );
}
#[doc = ""]
pub type cef_list_value_t = _cef_list_value_t;
extern "C" {
    #[doc = ""]
    pub fn cef_list_value_create() -> *mut cef_list_value_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_image_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_empty: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_image_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_same: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            that: *mut _cef_image_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub add_bitmap: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            pixel_width: ::std::os::raw::c_int,
            pixel_height: ::std::os::raw::c_int,
            color_type: cef_color_type_t::Type,
            alpha_type: cef_alpha_type_t::Type,
            pixel_data: *const ::std::os::raw::c_void,
            pixel_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub add_png: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            png_data: *const ::std::os::raw::c_void,
            png_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub add_jpeg: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            jpeg_data: *const ::std::os::raw::c_void,
            jpeg_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_width:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_image_t) -> usize>,
    #[doc = ""]
    pub get_height:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_image_t) -> usize>,
    #[doc = ""]
    pub has_representation: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub remove_representation: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_representation_info: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            actual_scale_factor: *mut f32,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_as_bitmap: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            color_type: cef_color_type_t::Type,
            alpha_type: cef_alpha_type_t::Type,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = ""]
    pub get_as_png: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            with_transparency: ::std::os::raw::c_int,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = ""]
    pub get_as_jpeg: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            quality: ::std::os::raw::c_int,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
}
#[test]
fn bindgen_test_layout__cef_image_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_image_t>(),
        72usize,
        concat!("Size of: ", stringify!(_cef_image_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_image_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_image_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).is_empty as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(is_empty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).is_same as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(is_same)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).add_bitmap as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(add_bitmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).add_png as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(add_png)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).add_jpeg as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(add_jpeg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).get_width as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(get_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).get_height as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(get_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).has_representation as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(has_representation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_image_t>())).remove_representation as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(remove_representation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_image_t>())).get_representation_info as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(get_representation_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).get_as_bitmap as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(get_as_bitmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).get_as_png as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(get_as_png)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_image_t>())).get_as_jpeg as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_image_t),
            "::",
            stringify!(get_as_jpeg)
        )
    );
}
#[doc = ""]
pub type cef_image_t = _cef_image_t;
extern "C" {
    #[doc = ""]
    pub fn cef_image_create() -> *mut cef_image_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_read_handler_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub read: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_read_handler_t,
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    #[doc = ""]
    pub seek: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_read_handler_t,
            offset: int64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub tell:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_read_handler_t) -> int64>,
    #[doc = ""]
    pub eof: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_read_handler_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub may_block: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_read_handler_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_read_handler_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_read_handler_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_read_handler_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_read_handler_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_read_handler_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_read_handler_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_read_handler_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_read_handler_t>())).read as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_read_handler_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_read_handler_t>())).seek as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_read_handler_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_read_handler_t>())).tell as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_read_handler_t),
            "::",
            stringify!(tell)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_read_handler_t>())).eof as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_read_handler_t),
            "::",
            stringify!(eof)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_read_handler_t>())).may_block as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_read_handler_t),
            "::",
            stringify!(may_block)
        )
    );
}
#[doc = ""]
pub type cef_read_handler_t = _cef_read_handler_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_stream_reader_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub read: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_stream_reader_t,
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    #[doc = ""]
    pub seek: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_stream_reader_t,
            offset: int64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub tell: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_stream_reader_t) -> int64,
    >,
    #[doc = ""]
    pub eof: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_stream_reader_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub may_block: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_stream_reader_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_stream_reader_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_stream_reader_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_stream_reader_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_stream_reader_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_stream_reader_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_reader_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_reader_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_reader_t>())).read as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_reader_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_reader_t>())).seek as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_reader_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_reader_t>())).tell as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_reader_t),
            "::",
            stringify!(tell)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_reader_t>())).eof as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_reader_t),
            "::",
            stringify!(eof)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_reader_t>())).may_block as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_reader_t),
            "::",
            stringify!(may_block)
        )
    );
}
#[doc = ""]
pub type cef_stream_reader_t = _cef_stream_reader_t;
extern "C" {
    #[doc = ""]
    pub fn cef_stream_reader_create_for_file(
        fileName: *const cef_string_t,
    ) -> *mut cef_stream_reader_t;
}
extern "C" {
    #[doc = ""]
    pub fn cef_stream_reader_create_for_data(
        data: *mut ::std::os::raw::c_void, size: usize,
    ) -> *mut cef_stream_reader_t;
}
extern "C" {
    #[doc = ""]
    pub fn cef_stream_reader_create_for_handler(
        handler: *mut cef_read_handler_t,
    ) -> *mut cef_stream_reader_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_write_handler_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub write: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_write_handler_t,
            ptr: *const ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    #[doc = ""]
    pub seek: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_write_handler_t,
            offset: int64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub tell: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_write_handler_t) -> int64,
    >,
    #[doc = ""]
    pub flush: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_write_handler_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub may_block: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_write_handler_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_write_handler_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_write_handler_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_write_handler_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_write_handler_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_write_handler_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_write_handler_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_write_handler_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_write_handler_t>())).write as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_write_handler_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_write_handler_t>())).seek as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_write_handler_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_write_handler_t>())).tell as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_write_handler_t),
            "::",
            stringify!(tell)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_write_handler_t>())).flush as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_write_handler_t),
            "::",
            stringify!(flush)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_write_handler_t>())).may_block as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_write_handler_t),
            "::",
            stringify!(may_block)
        )
    );
}
#[doc = ""]
pub type cef_write_handler_t = _cef_write_handler_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_stream_writer_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub write: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_stream_writer_t,
            ptr: *const ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    #[doc = ""]
    pub seek: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_stream_writer_t,
            offset: int64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub tell: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_stream_writer_t) -> int64,
    >,
    #[doc = ""]
    pub flush: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_stream_writer_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub may_block: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_stream_writer_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_stream_writer_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_stream_writer_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_stream_writer_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_stream_writer_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_stream_writer_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_writer_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_writer_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_writer_t>())).write as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_writer_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_writer_t>())).seek as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_writer_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_writer_t>())).tell as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_writer_t),
            "::",
            stringify!(tell)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_writer_t>())).flush as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_writer_t),
            "::",
            stringify!(flush)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_stream_writer_t>())).may_block as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_stream_writer_t),
            "::",
            stringify!(may_block)
        )
    );
}
#[doc = ""]
pub type cef_stream_writer_t = _cef_stream_writer_t;
extern "C" {
    #[doc = ""]
    pub fn cef_stream_writer_create_for_file(
        fileName: *const cef_string_t,
    ) -> *mut cef_stream_writer_t;
}
extern "C" {
    #[doc = ""]
    pub fn cef_stream_writer_create_for_handler(
        handler: *mut cef_write_handler_t,
    ) -> *mut cef_stream_writer_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_drag_data_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub clone: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> *mut _cef_drag_data_t,
    >,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_link: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_fragment: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_file: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_link_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_link_title: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_link_metadata: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_fragment_text: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_fragment_html: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_fragment_base_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_file_name: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_file_contents: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_drag_data_t,
            writer: *mut _cef_stream_writer_t,
        ) -> usize,
    >,
    #[doc = ""]
    pub get_file_names: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_drag_data_t,
            names: cef_string_list_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_link_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t, url: *const cef_string_t),
    >,
    #[doc = ""]
    pub set_link_title: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t, title: *const cef_string_t),
    >,
    #[doc = ""]
    pub set_link_metadata: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t, data: *const cef_string_t),
    >,
    #[doc = ""]
    pub set_fragment_text: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t, text: *const cef_string_t),
    >,
    #[doc = ""]
    pub set_fragment_html: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t, html: *const cef_string_t),
    >,
    #[doc = ""]
    pub set_fragment_base_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t, base_url: *const cef_string_t),
    >,
    #[doc = ""]
    pub reset_file_contents:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t)>,
    #[doc = ""]
    pub add_file: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_drag_data_t,
            path: *const cef_string_t,
            display_name: *const cef_string_t,
        ),
    >,
    #[doc = ""]
    pub get_image: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> *mut _cef_image_t,
    >,
    #[doc = ""]
    pub get_image_hotspot: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> cef_point_t,
    >,
    #[doc = ""]
    pub has_image: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout__cef_drag_data_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_drag_data_t>(),
        120usize,
        concat!("Size of: ", stringify!(_cef_drag_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_drag_data_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_drag_data_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).clone as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(clone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).is_read_only as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).is_link as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(is_link)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).is_fragment as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(is_fragment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).is_file as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(is_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).get_link_url as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_link_url)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).get_link_title as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_link_title)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).get_link_metadata as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_link_metadata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).get_fragment_text as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_fragment_text)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).get_fragment_html as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_fragment_html)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).get_fragment_base_url as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_fragment_base_url)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).get_file_name as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_file_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).get_file_contents as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_file_contents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).get_file_names as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_file_names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).set_link_url as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(set_link_url)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).set_link_title as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(set_link_title)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).set_link_metadata as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(set_link_metadata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).set_fragment_text as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(set_fragment_text)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).set_fragment_html as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(set_fragment_html)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).set_fragment_base_url as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(set_fragment_base_url)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).reset_file_contents as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(reset_file_contents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).add_file as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(add_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).get_image as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_image)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_drag_data_t>())).get_image_hotspot as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(get_image_hotspot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_drag_data_t>())).has_image as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_drag_data_t),
            "::",
            stringify!(has_image)
        )
    );
}
#[doc = ""]
pub type cef_drag_data_t = _cef_drag_data_t;
extern "C" {
    #[doc = ""]
    pub fn cef_drag_data_create() -> *mut cef_drag_data_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_domvisitor_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub visit: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domvisitor_t,
            document: *mut _cef_domdocument_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout__cef_domvisitor_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_domvisitor_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_domvisitor_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_domvisitor_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_domvisitor_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domvisitor_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domvisitor_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domvisitor_t>())).visit as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domvisitor_t),
            "::",
            stringify!(visit)
        )
    );
}
#[doc = ""]
pub type cef_domvisitor_t = _cef_domvisitor_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_domdocument_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub get_type: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> cef_dom_document_type_t::Type,
    >,
    #[doc = ""]
    pub get_document: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_body: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_head: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_title: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_element_by_id: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domdocument_t,
            id: *const cef_string_t,
        ) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_focused_node: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub has_selection: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_selection_start_offset: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_selection_end_offset: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_selection_as_markup: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_selection_as_text: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_base_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_complete_url: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domdocument_t,
            partialURL: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
}
#[test]
fn bindgen_test_layout__cef_domdocument_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_domdocument_t>(),
        76usize,
        concat!("Size of: ", stringify!(_cef_domdocument_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_domdocument_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_domdocument_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domdocument_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domdocument_t>())).get_type as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domdocument_t>())).get_document as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_document)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domdocument_t>())).get_body as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_body)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domdocument_t>())).get_head as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_head)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domdocument_t>())).get_title as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_title)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).get_element_by_id as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_element_by_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).get_focused_node as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_focused_node)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).has_selection as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(has_selection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).get_selection_start_offset as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_selection_start_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).get_selection_end_offset as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_selection_end_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).get_selection_as_markup as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_selection_as_markup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).get_selection_as_text as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_selection_as_text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domdocument_t>())).get_base_url as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_base_url)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domdocument_t>())).get_complete_url as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domdocument_t),
            "::",
            stringify!(get_complete_url)
        )
    );
}
#[doc = ""]
pub type cef_domdocument_t = _cef_domdocument_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_domnode_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub get_type: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_dom_node_type_t::Type,
    >,
    #[doc = ""]
    pub is_text: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_element: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_editable: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_form_control_element: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_form_control_element_type: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub is_same: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domnode_t,
            that: *mut _cef_domnode_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_name: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_value: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub set_value: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domnode_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_as_markup: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_document: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domdocument_t,
    >,
    #[doc = ""]
    pub get_parent: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_previous_sibling: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_next_sibling: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub has_children: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_first_child: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_last_child: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    #[doc = ""]
    pub get_element_tag_name: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub has_element_attributes: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub has_element_attribute: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domnode_t,
            attrName: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_element_attribute: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domnode_t,
            attrName: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_element_attributes: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t, attrMap: cef_string_map_t),
    >,
    #[doc = ""]
    pub set_element_attribute: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_domnode_t,
            attrName: *const cef_string_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_element_inner_text: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_element_bounds:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_domnode_t) -> cef_rect_t>,
}
#[test]
fn bindgen_test_layout__cef_domnode_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_domnode_t>(),
        124usize,
        concat!("Size of: ", stringify!(_cef_domnode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_domnode_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_domnode_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_type as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).is_text as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(is_text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).is_element as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(is_element)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).is_editable as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(is_editable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).is_form_control_element as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(is_form_control_element)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).get_form_control_element_type as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_form_control_element_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).is_same as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(is_same)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_name as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_value as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).set_value as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(set_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_as_markup as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_as_markup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_document as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_document)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_parent as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_parent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).get_previous_sibling as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_previous_sibling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_next_sibling as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_next_sibling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).has_children as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(has_children)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_first_child as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_first_child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_domnode_t>())).get_last_child as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_last_child)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).get_element_tag_name as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_element_tag_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).has_element_attributes as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(has_element_attributes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).has_element_attribute as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(has_element_attribute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).get_element_attribute as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_element_attribute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).get_element_attributes as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_element_attributes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).set_element_attribute as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(set_element_attribute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).get_element_inner_text as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_element_inner_text)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_domnode_t>())).get_element_bounds as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_domnode_t),
            "::",
            stringify!(get_element_bounds)
        )
    );
}
#[doc = ""]
pub type cef_domnode_t = _cef_domnode_t;
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_process_message_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_valid: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_process_message_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_process_message_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub copy: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_process_message_t,
        ) -> *mut _cef_process_message_t,
    >,
    #[doc = ""]
    pub get_name: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_process_message_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_argument_list: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_process_message_t) -> *mut _cef_list_value_t,
    >,
}
#[test]
fn bindgen_test_layout__cef_process_message_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_process_message_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_process_message_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_process_message_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_process_message_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_process_message_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_process_message_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_process_message_t>())).is_valid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_process_message_t),
            "::",
            stringify!(is_valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_process_message_t>())).is_read_only as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_process_message_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_process_message_t>())).copy as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_process_message_t),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_process_message_t>())).get_name as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_process_message_t),
            "::",
            stringify!(get_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_process_message_t>())).get_argument_list as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_process_message_t),
            "::",
            stringify!(get_argument_list)
        )
    );
}
#[doc = ""]
pub type cef_process_message_t = _cef_process_message_t;
extern "C" {
    #[doc = ""]
    pub fn cef_process_message_create(name: *const cef_string_t) -> *mut cef_process_message_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_request_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub set_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t, url: *const cef_string_t),
    >,
    #[doc = ""]
    pub get_method: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub set_method: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t, method: *const cef_string_t),
    >,
    #[doc = ""]
    pub set_referrer: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_request_t,
            referrer_url: *const cef_string_t,
            policy: cef_referrer_policy_t::Type,
        ),
    >,
    #[doc = ""]
    pub get_referrer_url: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_referrer_policy: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> cef_referrer_policy_t::Type,
    >,
    #[doc = ""]
    pub get_post_data: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> *mut _cef_post_data_t,
    >,
    #[doc = ""]
    pub set_post_data: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t, postData: *mut _cef_post_data_t),
    >,
    #[doc = ""]
    pub get_header_map: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t, headerMap: cef_string_multimap_t),
    >,
    #[doc = ""]
    pub set_header_map: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t, headerMap: cef_string_multimap_t),
    >,
    #[doc = ""]
    pub get_header_by_name: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_request_t,
            name: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub set_header_by_name: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_request_t,
            name: *const cef_string_t,
            value: *const cef_string_t,
            overwrite: ::std::os::raw::c_int,
        ),
    >,
    #[doc = ""]
    pub set: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_request_t,
            url: *const cef_string_t,
            method: *const cef_string_t,
            postData: *mut _cef_post_data_t,
            headerMap: cef_string_multimap_t,
        ),
    >,
    #[doc = ""]
    pub get_flags: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_flags: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t, flags: ::std::os::raw::c_int),
    >,
    #[doc = ""]
    pub get_first_party_for_cookies: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub set_first_party_for_cookies: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t, url: *const cef_string_t),
    >,
    #[doc = ""]
    pub get_resource_type: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> cef_resource_type_t::Type,
    >,
    #[doc = ""]
    pub get_transition_type: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> cef_transition_type_t::Type,
    >,
    #[doc = ""]
    pub get_identifier:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_request_t) -> uint64>,
}
#[test]
fn bindgen_test_layout__cef_request_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_request_t>(),
        108usize,
        concat!("Size of: ", stringify!(_cef_request_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_request_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_request_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).is_read_only as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).get_url as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_url)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).set_url as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_url)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).get_method as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).set_method as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).set_referrer as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_referrer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).get_referrer_url as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_referrer_url)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_t>())).get_referrer_policy as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_referrer_policy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).get_post_data as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_post_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).set_post_data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_post_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).get_header_map as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_header_map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).set_header_map as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_header_map)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_t>())).get_header_by_name as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_header_by_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_t>())).set_header_by_name as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_header_by_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).set as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).get_flags as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).set_flags as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_t>())).get_first_party_for_cookies as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_first_party_for_cookies)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_t>())).set_first_party_for_cookies as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(set_first_party_for_cookies)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_t>())).get_resource_type as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_resource_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_request_t>())).get_transition_type as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_transition_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_request_t>())).get_identifier as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_t),
            "::",
            stringify!(get_identifier)
        )
    );
}
#[doc = ""]
pub type cef_request_t = _cef_request_t;
extern "C" {
    #[doc = ""]
    pub fn cef_request_create() -> *mut cef_request_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_post_data_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_post_data_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub has_excluded_elements: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_post_data_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub get_element_count:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_post_data_t) -> usize>,
    #[doc = ""]
    pub get_elements: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_post_data_t,
            elementsCount: *mut usize,
            elements: *mut *mut _cef_post_data_element_t,
        ),
    >,
    #[doc = ""]
    pub remove_element: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_post_data_t,
            element: *mut _cef_post_data_element_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub add_element: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_post_data_t,
            element: *mut _cef_post_data_element_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub remove_elements:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_post_data_t)>,
}
#[test]
fn bindgen_test_layout__cef_post_data_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_post_data_t>(),
        48usize,
        concat!("Size of: ", stringify!(_cef_post_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_post_data_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_post_data_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_post_data_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_post_data_t>())).is_read_only as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_t>())).has_excluded_elements as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(has_excluded_elements)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_t>())).get_element_count as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(get_element_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_post_data_t>())).get_elements as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(get_elements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_post_data_t>())).remove_element as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(remove_element)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_post_data_t>())).add_element as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(add_element)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_t>())).remove_elements as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_t),
            "::",
            stringify!(remove_elements)
        )
    );
}
#[doc = ""]
pub type cef_post_data_t = _cef_post_data_t;
extern "C" {
    #[doc = ""]
    pub fn cef_post_data_create() -> *mut cef_post_data_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_post_data_element_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_read_only: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_post_data_element_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub set_to_empty:
        ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_post_data_element_t)>,
    #[doc = ""]
    pub set_to_file: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_post_data_element_t,
            fileName: *const cef_string_t,
        ),
    >,
    #[doc = ""]
    pub set_to_bytes: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_post_data_element_t,
            size: usize,
            bytes: *const ::std::os::raw::c_void,
        ),
    >,
    #[doc = ""]
    pub get_type: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_post_data_element_t,
        ) -> cef_postdataelement_type_t::Type,
    >,
    #[doc = ""]
    pub get_file: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_post_data_element_t) -> cef_string_userfree_t,
    >,
    #[doc = ""]
    pub get_bytes_count: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_post_data_element_t) -> usize,
    >,
    #[doc = ""]
    pub get_bytes: ::std::option::Option<
        unsafe extern "stdcall" fn(
            self_: *mut _cef_post_data_element_t,
            size: usize,
            bytes: *mut ::std::os::raw::c_void,
        ) -> usize,
    >,
}
#[test]
fn bindgen_test_layout__cef_post_data_element_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_post_data_element_t>(),
        52usize,
        concat!("Size of: ", stringify!(_cef_post_data_element_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_post_data_element_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_post_data_element_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_post_data_element_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).is_read_only as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(is_read_only)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).set_to_empty as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(set_to_empty)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).set_to_file as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(set_to_file)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).set_to_bytes as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(set_to_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).get_type as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(get_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).get_file as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(get_file)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).get_bytes_count as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(get_bytes_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_cef_post_data_element_t>())).get_bytes as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_post_data_element_t),
            "::",
            stringify!(get_bytes)
        )
    );
}
#[doc = ""]
pub type cef_post_data_element_t = _cef_post_data_element_t;
extern "C" {
    #[doc = ""]
    pub fn cef_post_data_element_create() -> *mut cef_post_data_element_t;
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_string_visitor_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub visit: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_string_visitor_t, string: *const cef_string_t),
    >,
}
#[test]
fn bindgen_test_layout__cef_string_visitor_t() {
    assert_eq!(
        ::std::mem::size_of::<_cef_string_visitor_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_string_visitor_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_string_visitor_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_string_visitor_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_visitor_t>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_visitor_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_cef_string_visitor_t>())).visit as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_visitor_t),
            "::",
            stringify!(visit)
        )
    );
}
#[doc = ""]
pub type cef_string_visitor_t = _cef_string_visitor_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlrequest_client_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlrequest_t {
    _unused: [u8; 0],
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_frame_t {
    #[doc = ""]
    pub base: cef_base_ref_counted_t,
    #[doc = ""]
    pub is_valid: ::std::option::Option<
        unsafe extern "stdcall" fn(self_: *mut _cef_frame_t) -> ::std::os::raw::c_int,
    >,
    #[doc = ""]
    pub undo: ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_frame_t)>,
    #[doc = ""]
    pub redo: ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_frame_t)>,
    #[doc = ""]
    pub cut: ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_frame_t)>,
    #[doc = ""]
    pub copy: ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_frame_t)>,
    #[doc = ""]
    pub paste: ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_frame_t)>,
    #[doc = ""]
    pub del: ::std::option::Option<unsafe extern "stdcall" fn(self_: *mut _cef_frame_t)>,
    #[doc = ""]
